/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: getopt.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2008 年 08 月 16 日
**
** 描        述: 兼容 POSIX 的 getopt 解析 argc argv 参数标准库 (全局变量抽象) (支持重入).
*********************************************************************************************************/

#ifndef __GETOPT_VAR_H
#define __GETOPT_VAR_H

/*********************************************************************************************************
  裁剪控制
*********************************************************************************************************/
#if LW_CFG_SHELL_EN > 0

#ifdef __SYLIXOS_KERNEL
VOID  __tShellOptDeleteHook(LW_OBJECT_HANDLE  ulId, 
                            PVOID             pvReturnVal, 
                            PLW_CLASS_TCB     ptcb);
#endif                                                                  /*  __SYLIXOS_KERNEL            */
/*********************************************************************************************************
  API
*********************************************************************************************************/

LW_API INT                  *API_TShellOptErr(VOID);
LW_API INT                  *API_TShellOptInd(VOID);
LW_API INT                  *API_TShellOptOpt(VOID);
LW_API INT                  *API_TShellOptReset(VOID);
LW_API PCHAR                *API_TShellOptArg(VOID);
LW_API VOID                  API_TShellOptFree(VOID);

/*********************************************************************************************************
  被多线程上下文模拟出的"全局变量"
*********************************************************************************************************/

#define opterr             (*API_TShellOptErr())
#define optind             (*API_TShellOptInd())
#define optopt             (*API_TShellOptOpt())
#define optreset           (*API_TShellOptReset())
#define optarg             (*API_TShellOptArg())

#define getopt_free          API_TShellOptFree

#endif                                                                  /*  LW_CFG_SHELL_EN > 0         */
#endif                                                                  /*  __GETOPT_VAR_H              */
/*********************************************************************************************************
  END
*********************************************************************************************************/
