/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: getopt_long.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2008 年 08 月 16 日
**
** 描        述: 兼容 POSIX 的 getopt 解析 argc argv 参数标准库 (支持重入).
*********************************************************************************************************/

#ifndef __GETOPT_LONG_H
#define __GETOPT_LONG_H

/*********************************************************************************************************
  裁剪控制
*********************************************************************************************************/
#if LW_CFG_SHELL_EN > 0

#ifndef __DEFINE_ARGOPT
#define __DEFINE_ARGOPT
struct option {
    const char *name;                                                   /*  这是选项名，前面没有短横线。*/
    int         has_arg;                                                /*  描述了选项是否有选项参数    */
    int        *flag;
    int         val;
};
#endif                                                                  /*  __DEFINE_ARGOPT             */

/*********************************************************************************************************
  API 函数
*********************************************************************************************************/
int  getopt_long(int nargc, char * const *nargv, const char *options,
	             const struct option *long_options, int *idx);

int  getopt_long_only(int nargc, char * const *nargv, const char *options,
		              const struct option *long_options, int *idx);

#endif                                                                  /*  LW_CFG_SHELL_EN > 0         */
#endif                                                                  /*  __GETOPT_LONG_H             */
/*********************************************************************************************************
  END
*********************************************************************************************************/
