/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: getopt.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2008 年 08 月 16 日
**
** 描        述: 兼容 POSIX 的 getopt 解析 argc argv 参数标准库 (支持重入).
*********************************************************************************************************/

#ifndef __GETOPT_H
#define __GETOPT_H

/*********************************************************************************************************
  裁剪控制
*********************************************************************************************************/
#if LW_CFG_SHELL_EN > 0

/*********************************************************************************************************
  NetBSD 移植相关宏
*********************************************************************************************************/

#define warnx                   printf                                  /*  UNIX 错误打印               */

/*********************************************************************************************************
  getopt\getopt_long 选项, 参数, 类型
*********************************************************************************************************/

#define no_argument             0                                       /*  选项没有参数                */
#define required_argument       1                                       /*  选项需要参数                */
#define optional_argument       2                                       /*  选项参数可选                */

#ifndef __DEFINE_ARGOPT
#define __DEFINE_ARGOPT
struct option {
    const char *name;                                                   /*  这是选项名，前面没有短横线。*/
    int         has_arg;                                                /*  描述了选项是否有选项参数    */
    int        *flag;
    int         val;
};
#endif                                                                  /*  __DEFINE_ARGOPT             */

/*********************************************************************************************************
  以上结构体字段解释:
  
  int *flag
  
  如果这个指针为NULL，那么 getopt_long()返回该结构val字段中的数值。如果该指针不为NULL，getopt_long()
  会使得它所指向的变量中填入val字段中的数值，并且getopt_long()返回0。如果flag不是NULL，但未发现长选项，
  那么它所指向的变量的数值不变。
  
  int val
  
  这个值是发现了长选项时的返回值，或者flag不是NULL时载入*flag中的值。典型情况下，若flag不是NULL，那么val
  是个真／假值，譬如1或0；另一方面，如果flag是NULL，那么 val通常是字符常量，若长选项与短选项一致，
  那么该字符常量应该与optstring中出现的这个选项的参数相同。

*********************************************************************************************************/

/*********************************************************************************************************
  API 函数
*********************************************************************************************************/
int getopt(int nargc, char * const *nargv, const char *options);

#endif                                                                  /*  LW_CFG_SHELL_EN > 0         */
#endif                                                                  /*  __GETOPT_H                  */
/*********************************************************************************************************
  END
*********************************************************************************************************/
