/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: resourceLib.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2012 年 12 月 06 日
**
** 描        述: 资源管理器 (内核初始化完成前的对象不必存储)
*********************************************************************************************************/

#ifndef __RESOURCELIB_H
#define __RESOURCELIB_H

/*********************************************************************************************************
  原始资源操作函数
*********************************************************************************************************/
#if LW_CFG_MODULELOADER_EN > 0

VOID  __resAddRawHook(PLW_RESOURCE_RAW    presraw, 
                      VOIDFUNCPTR         pvfunc,
                      PVOID               pvArg0,
                      PVOID               pvArg1,
                      PVOID               pvArg2,
                      PVOID               pvArg3,
                      PVOID               pvArg4,
                      PVOID               pvArg5);                      /*  创建一个原始资源            */
                      
VOID  __resDelRawHook(PLW_RESOURCE_RAW    presraw);                     /*  删除一个原始资源            */

/*********************************************************************************************************
  句柄类资源操作函数
*********************************************************************************************************/

BOOL  __resHandleIsGlobal(LW_OBJECT_HANDLE  ulHandle);
INT   __resHandleMakeGlobal(LW_OBJECT_HANDLE  ulHandle);
INT   __resHandleMakeLocal(LW_OBJECT_HANDLE  ulHandle);

/*********************************************************************************************************
  进程退出时资源释放操作
*********************************************************************************************************/

VOID  __resThreadDelHook(PVOID  pvVProc, LW_OBJECT_HANDLE  ulId);       /*  线程结束完毕回调            */
INT   __resPidReclaim(pid_t  pid);                                      /*  回收指定进程的资源          */
INT   __resPidReclaimOnlyRaw(pid_t  pid);                               /*  仅回收原始资源              */

/*********************************************************************************************************
  资源回收
*********************************************************************************************************/

VOID  __resReclaimReq(PVOID  pvVProc);                                  /*  请求回收进程资源            */

/*********************************************************************************************************
  资源管理器初始化
*********************************************************************************************************/

VOID  _resInit(VOID);                                                   /*  SylixOS 内部调用初始化函数  */

#else                                                                   /*  没有进程支持, 不需要此功能  */

#define __resAddRawHook(a, b, c, d, e, f, g, h)
#define __resDelRawHook(a)

#endif                                                                  /*  LW_CFG_MODULELOADER_EN > 0  */
#endif                                                                  /*  __RESOURCELIB_H             */
/*********************************************************************************************************
  END
*********************************************************************************************************/
