/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: resourceReclaim.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2012 年 12 月 09 日
**
** 描        述: 为了避免僵尸线程, SylixOS 使用统一的资源回收器进行资源回收.
*********************************************************************************************************/

#ifndef __RESOURCERECLAIM_H
#define __RESOURCERECLAIM_H

#if LW_CFG_MODULELOADER_EN > 0

VOID  __resReclaimInit(VOID);

#endif                                                                  /*  LW_CFG_MODULELOADER_EN > 0  */
#endif                                                                  /*  __RESOURCERECLAIM_H         */
/*********************************************************************************************************
  END
*********************************************************************************************************/
