/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: mipsExcAsm.h
**
** 创   建   人: Ryan.Xin (信金龙)
**
** 文件创建日期: 2015 年 09 月 01 日
**
** 描        述: MIPS 体系构架异常处理.
*********************************************************************************************************/

#ifndef __MIPSEXCASM_H
#define __MIPSEXCASM_H

    IMPORT_LABEL(archInterruptEntry)
    IMPORT_LABEL(archCacheErrorEntry)
    IMPORT_LABEL(archExceptionEntry)
    IMPORT_LABEL(mips32TlbRefillEntry)

;/*********************************************************************************************************
;  Cache 错误异常入口跳转
;*********************************************************************************************************/

MACRO_DEF(MIPS_CACHE_ERROR_HANDLE)
    .set    push
    .set    noat
    .set    noreorder
    .set    volatile

    J       archCacheErrorEntry
    NOP

    .set    pop
    MACRO_END()

;/*********************************************************************************************************
;  通用异常入口跳转
;*********************************************************************************************************/

MACRO_DEF(MIPS_EXCEPTION_HANDLE)
    .set    push
    .set    noat
    .set    noreorder
    .set    volatile

    J       archExceptionEntry
    NOP

    .set    pop
    MACRO_END()

;/*********************************************************************************************************
;  中断入口跳转
;*********************************************************************************************************/

MACRO_DEF(MIPS_INTERRUPT_HANDLE)
    .set    push
    .set    noat
    .set    noreorder
    .set    volatile

    J       archInterruptEntry
    NOP

    .set    pop
    MACRO_END()

;/*********************************************************************************************************
;  TLB 重填入口跳转
;*********************************************************************************************************/

MACRO_DEF(MIPS32_TLB_REFILL_HANDLE)
    .set    push
    .set    noat
    .set    noreorder
    .set    volatile

    J       mips32TlbRefillEntry
    NOP

    .set    pop
    MACRO_END()

#endif                                                                  /*  __MIPSEXCASM_H              */
;/*********************************************************************************************************
;  END
;*********************************************************************************************************/
