/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: bitfield.h
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2016 年 11 月 24 日
**
** 描        述: 位域.
*********************************************************************************************************/

#ifndef __ARCH_MIPSBITFIELD_H
#define __ARCH_MIPSBITFIELD_H

/*
 * Damn ...  bitfields depend from byteorder :-(
 */
#if BYTE_ORDER == BIG_ENDIAN
#define __BITFIELD_FIELD(field, more)   \
    field;                              \
    more

#else

#define __BITFIELD_FIELD(field, more)   \
    more                                \
    field;

#endif
#endif                                                                  /*  __ARCH_MIPSBITFIELD_H       */
/*********************************************************************************************************
  END
*********************************************************************************************************/
