/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: symLibc.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2011 年 03 月 04 日
**
** 描        述: gcc 编译器可能会自动生成调用 memcmp, memset, memcpy and memmove 的程序, 所以, 这些符号
                 必须添加在 sylixos 符号表中, 这样装载器才能装载这个程序, 
                 
                 例如: char  a[] = "abcd"; gcc 编译动态库后, 会自动调用 memcpy 来进行初始化.
                 这里的符号保证了在动态链接时, 不会产生一些符号的未定义错误.
                 
                 可参考: http://gcc.gnu.org/onlinedocs/gcc/Link-Options.html
*********************************************************************************************************/

#ifndef __SYMLIBC_H
#define __SYMLIBC_H

/*********************************************************************************************************
  裁剪支持
*********************************************************************************************************/
#if LW_CFG_SYMBOL_EN > 0

INT  __symbolAddLibc(VOID);

#endif                                                                  /*  LW_CFG_SYMBOL_EN > 0        */
#endif                                                                  /*  __SYMLIBC_H                 */
/*********************************************************************************************************
  END
*********************************************************************************************************/
