/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: armVfp11.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2013 年 12 月 09 日
**
** 描        述: ARM 体系架构 VFP11 (VFPv2 for ARM11) 支持.
*********************************************************************************************************/

#ifndef __ARMVFP11_H
#define __ARMVFP11_H

PARM_FPU_OP  armVfp11PrimaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);
VOID         armVfp11SecondaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);

#endif                                                                  /*  __ARMVFP11_H                */
/*********************************************************************************************************
  END
*********************************************************************************************************/
