/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: lwip_vlan.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2009 年 07 月 13 日
**
** 描        述: lwip vlan 支持.
*********************************************************************************************************/

#ifndef LWIP_VLAN_H
#define LWIP_VLAN_H

/*********************************************************************************************************
  裁剪控制
*********************************************************************************************************/
#if (LW_CFG_NET_EN > 0) && (LW_CFG_NET_VLAN_EN > 0)

LW_API  INT     API_VlanGet(CPCHAR  pcEthIf, INT  *piVlanId);
LW_API  INT     API_VlanSet(CPCHAR  pcEthIf, INT  iVlanId);
LW_API  VOID    API_VlanShow(VOID);

#define inetVlanGet     API_VlanGet
#define inetVlanSet     API_VlanSet
#define inetVlanShow    API_VlanShow

#endif                                                                  /*  LW_CFG_NET_EN > 0           */
                                                                        /*  LW_CFG_NET_VLAN_EN > 0      */
#endif                                                                  /*  LWIP_VLAN_H                 */
/*********************************************************************************************************
  END
*********************************************************************************************************/
