/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: hashHorner.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2008 年 07 月 27 日
**
** 描        述: 哈希散列函数, 使用变种的霍纳(horner)算法进行一级散列.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
#include "../SylixOS/system/include/s_system.h"
/*********************************************************************************************************
** 函数名称: __hashHorner
** 功能描述: 霍纳(horner)多项式, 哈希散列函数
** 输　入  : pcKeyword       需要计算散列值的关键字
**           iTableSize      散列表大小
** 输　出  : 散列的结果
** 全局变量: 
** 调用模块: 
** 注  意  : 哈希表的大小最好为素数, 这样散列的效果最好.
**           本算法专为变量管理器和 shell 管理器设计, 采用一阶散列表进行搜索.
**           Hk = K1 + 27 * K2 + 27^2 * K3... --->
**           Hk = ((K3) * 27 + K2) * 27 + K1
**           将霍纳多项式的 27 改为 32 有利于计算机的移位运算.
*********************************************************************************************************/
INT  __hashHorner (CPCHAR  pcKeyword, INT  iTableSize)
{
    unsigned int  iHashVal = 0;
    
    while (*pcKeyword != PX_EOS) {                                      /*  奇数字符运算                */
        iHashVal = (iHashVal << 5) + *pcKeyword++;
        if (*pcKeyword != PX_EOS) {
            pcKeyword++;
        }
    }
    
    return  (iHashVal % iTableSize);
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
