/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: sdmemory.h
**
** 创   建   人: Zeng.Bo (曾波)
**
** 文件创建日期: 2010 年 11 月 25 日
**
** 描        述: sd记忆卡客户应用驱动头文件

** BUG:
2011.03.25  修改 API_SdMemDevCreate(), 用于底层驱动安装上层的回调.
*********************************************************************************************************/

#ifndef __SDMEMORY_H
#define __SDMEMORY_H

/*********************************************************************************************************
  记忆卡相关宏定义
*********************************************************************************************************/

#define SD_MEM_DEFAULT_BLKSIZE_NBITS   9
#define SD_MEM_DEFAULT_BLKSIZE         512
#define SD_MIN_PRE_ERASE_BLKLEN        10                               /*  预擦除块的最小值. 小于此值  */
                                                                        /*  不执行预擦除功能            */
/*********************************************************************************************************
  SD 驱动函数结构
*********************************************************************************************************/

struct  __sdmem_drv_funcs;
typedef struct __sdmem_drv_funcs    SDMEM_DRV_FUNCS;

typedef struct __sdmem_chan {
    SDMEM_DRV_FUNCS    *SDMEMCHA_pDrvFuncs;
} LW_SDMEM_CHAN, *PLW_SDMEM_CHAN;

/*********************************************************************************************************
  SD Memory 回调函数
*********************************************************************************************************/

#ifdef  __cplusplus
typedef INT     (*SDMEM_CALLBACK)(...);
#else
typedef INT     (*SDMEM_CALLBACK)();
#endif

/*********************************************************************************************************
  SD 驱动安装回调函数
*********************************************************************************************************/

typedef INT     (*SDMEM_CALLBACK_INSTALL)
                (
                PLW_SDMEM_CHAN   psdmemchan,                            /*  安装回调使用的参数 驱动定义 */
                INT              iCallbackType,                         /*  安装的回调函数的类型        */
                SDMEM_CALLBACK   callback,                              /*  回调函数指针                */
                PVOID            pvCallbackArg                          /*  回调函数的参数              */
                );

/*********************************************************************************************************
  SD SPI模式下的片选回调
*********************************************************************************************************/

typedef VOID    (*SDMEM_CALLBACK_SPICS_ENABLE)(PLW_SDMEM_CHAN   psdmemchan);
typedef VOID    (*SDMEM_CALLBACK_SPICS_DISABLE)(PLW_SDMEM_CHAN   psdmemchan);

/*********************************************************************************************************
  SD 驱动结构
*********************************************************************************************************/

struct __sdmem_drv_funcs {
    SDMEM_CALLBACK_INSTALL       callbackInstall;
    SDMEM_CALLBACK_SPICS_ENABLE  callbackSpicsEn;
    SDMEM_CALLBACK_SPICS_DISABLE callbackSpicsDis;
};

/*********************************************************************************************************
  SD 安装回调函数类型
*********************************************************************************************************/

#define SD_MEM_CALLBACK_CHECK_DEV     0                                 /*  卡状态检测                  */

#define SD_MEM_DEVSTA_UNEXIST         0                                 /*  卡状态:不存在               */
#define SD_MEM_DEVSTA_EXIST           1                                 /*  卡状态:存在                 */

/*********************************************************************************************************
  API
*********************************************************************************************************/

LW_API PLW_BLK_DEV API_SdMemDevCreate(INT               iAdapterType,
                                      CPCHAR            pcAdapterName,
                                      CPCHAR            pcDeviceName,
                                      PLW_SDMEM_CHAN    psdmemchan);
LW_API INT         API_SdMemDevDelete(PLW_BLK_DEV pblkdevice);
LW_API INT         API_SdMemDevShow(PLW_BLK_DEV pblkdevice);

#endif                                                                  /*  __SDMEMORY_H                */
/*********************************************************************************************************
  END
*********************************************************************************************************/
