/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: _BitmapLib.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2014 年 11 月 10 日
**
** 描        述: 位图操作库. 
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
/*********************************************************************************************************
** 函数名称: _BitmapInit
** 功能描述: 初始化位图控制块
** 输　入  : pbmap         位图控制块
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  _BitmapInit (PLW_CLASS_BMAP  pbmap)
{
    lib_bzero(pbmap, sizeof(LW_CLASS_BMAP));
}
/*********************************************************************************************************
** 函数名称: _BitmapAdd
** 功能描述: 添加一个标记到位图表
** 输　入  : pbmap         位图控制块
**           ucPriority    优先级
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  _BitmapAdd (PLW_CLASS_BMAP  pbmap, UINT8  ucPriority)
{
    pbmap->BMAP_uiMap |= (1 << (ucPriority >> 5));
    pbmap->BMAP_uiSubMap[ucPriority >> 5] |= (1 << (ucPriority & 0x1f));
}
/*********************************************************************************************************
** 函数名称: _BitmapDel
** 功能描述: 从位图表删除一个标记
** 输　入  : pbmap         位图控制块
**           ucPriority    优先级
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  _BitmapDel (PLW_CLASS_BMAP  pbmap, UINT8  ucPriority)
{
    pbmap->BMAP_uiSubMap[ucPriority >> 5] &= ~(1 << (ucPriority & 0x1f));
    if (pbmap->BMAP_uiSubMap[ucPriority >> 5] == 0) {
        pbmap->BMAP_uiMap &= ~(1 << (ucPriority >> 5));
    }
}
/*********************************************************************************************************
** 函数名称: _BitmapHigh
** 功能描述: 获得位图表中的最高优先级
** 输　入  : pbmap         位图控制块
** 输　出  : 优先级
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
UINT8  _BitmapHigh (PLW_CLASS_BMAP  pbmap)
{
    UINT32  uiHigh = (UINT32)archFindLsb((INT)pbmap->BMAP_uiMap);
    UINT32  uiLow;
    
    if (uiHigh == 0) {
        return  (0);
    }
    
    uiHigh--;
    uiLow = (UINT32)archFindLsb((INT)pbmap->BMAP_uiSubMap[uiHigh]) - 1;
    
    return  ((UINT8)((uiHigh << 5) | uiLow));
}
/*********************************************************************************************************
** 函数名称: _BitmapIsEmpty
** 功能描述: 判断位图表是否为空
** 输　入  : pbmap         位图控制块
** 输　出  : 是否为空
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
BOOL  _BitmapIsEmpty (PLW_CLASS_BMAP  pbmap)
{
    return  ((pbmap->BMAP_uiMap) ? LW_FALSE : LW_TRUE);
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
