/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: _CoroutineShell.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2008 年 06 月 19 日
**
** 描        述: 这是协程管理库(协程是一个轻量级的并发执行单位). 
                 协程运行外壳.
**
** BUG:
2016.12.27  首先要尝试回收刚刚删除的协程.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
/*********************************************************************************************************
  裁剪控制
*********************************************************************************************************/
#if LW_CFG_COROUTINE_EN > 0
/*********************************************************************************************************
** 函数名称: _CoroutineShell
** 功能描述: 在当前线程中创建一个协程.
** 输　入  : pvArg                     协程启动地址
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  _CoroutineShell (PVOID  pvArg)
{
             PLW_CLASS_TCB          ptcbCur;
    REGISTER PLW_CLASS_COROUTINE    pcrcb;
    
#if defined(LW_CFG_CPU_ARCH_C6X)
    archIntEnableForce();                                               /*  使能中断                    */
#endif                                                                  /*  LW_CFG_CPU_ARCH_C6X         */

    LW_TCB_GET_CUR_SAFE(ptcbCur);
    
    _CoroutineReclaim(ptcbCur);                                         /*  尝试回收已经删除的协程      */

    pcrcb = _LIST_ENTRY(ptcbCur->TCB_pringCoroutineHeader, 
                        LW_CLASS_COROUTINE, 
                        COROUTINE_ringRoutine);                         /*  获得当前协程                */
    
    LW_SOFUNC_PREPARE(pvArg);
    ((PCOROUTINE_START_ROUTINE)pvArg)(pcrcb->COROUTINE_pvArg);          /*  执行协程                    */
    
    API_CoroutineExit();
    
    for (;;) {
        API_CoroutineYield();
    }
}

#endif                                                                  /*  LW_CFG_COROUTINE_EN > 0     */
/*********************************************************************************************************
  END
*********************************************************************************************************/
