/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: _IdleThread.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2006 年 12 月 18 日
**
** 描        述: 这是系统空闲线程。

** BUG
2009.03.10  进入 idle 时需要将 errno 清零.
2009.04.11  加入多核的支持.
2012.03.19  这里提前记录 CPU ID, 这样就不必每次操作 _K_ulThreadIdleCounter 都获取 CPU ID.
2013.07.20  _K_ulThreadIdleCounter 不再使用数组, 直接 ++ 即可.
2014.01.06  不再需要 idle 计数器.
2016.05.10  idle hook 加入 cpuid 参数.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
/*********************************************************************************************************
** 函数名称: _IdleThread
** 功能描述: 空闲线程
** 输　入  : 
** 输　出  : 
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
PVOID  _IdleThread (PVOID  pvArg)
{
    ULONG  ulCPUId = (ULONG)pvArg;
    
    for (;;) {
        bspTaskIdleHook();                                              /*  空闲任务钩子函数            */
        __LW_THREAD_IDLE_HOOK(ulCPUId);
    }
    
    return  (LW_NULL);
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
