/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: _Object.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2006 年 12 月 17 日
**
** 描        述: 这是系统对象操作函数。

** BUG:
2009.12.11  修正注释.
2012.12.06  加入对 LW_OPTION_OBJECT_GLOBAL 的正确使用, 如果是 SylixOS 内核则为 GLOBAL, 其他则为 LOCAL.
2012.12.07  GLOBAL 不再放在句柄中.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
/*********************************************************************************************************
** 函数名称: _MakeObjectId
** 功能描述: 创建一个 ID 结构
** 输　入  : ucCls         对象类型
**           usNode        当前系统编号
**           usIndex       对象池下标
** 输　出  : 构建的对象句柄
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
LW_OBJECT_ID _MakeObjectId (UINT8  ucCls, UINT16  usNode, UINT16  usIndex)
{
    REGISTER ULONG    ulId;
    
    ulId = ((ULONG)(ucCls << 26) 
         | (ULONG)(usNode << 16) 
         | (ULONG)usIndex);
    
    return  (ulId);
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
