/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: _StackMem.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2016 年 05 月 05 日
**
** 描        述: 栈内存管理.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
/*********************************************************************************************************
  进程相关
*********************************************************************************************************/
#if LW_CFG_MODULELOADER_EN > 0
#include "../SylixOS/loader/include/loader_vppatch.h"
#endif                                                                  /*  LW_CFG_MODULELOADER_EN > 0  */
/*********************************************************************************************************
** 函数名称: _StackAllocate
** 功能描述: 分配栈内存
** 输　入  : ptcb      任务
**           ulOption  线程创建选项
**           stSize    需要的栈大小
** 输　出  : 栈内存
** 全局变量:
** 调用模块:
*********************************************************************************************************/
PLW_STACK  _StackAllocate (PLW_CLASS_TCB  ptcb, ULONG  ulOption, size_t  stSize)
{
#if LW_CFG_MODULELOADER_EN > 0
    return  ((PLW_STACK)vprocStackAlloc(ptcb, ulOption, stSize));
#else
    return  ((PLW_STACK)__KHEAP_ALLOC(stSize));
#endif                                                                  /*  LW_CFG_MODULELOADER_EN > 0  */
}
/*********************************************************************************************************
** 函数名称: _StackFree
** 功能描述: 回收栈内存
** 输　入  : ptcbDel       任务
**           pstk          栈内存
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  _StackFree (PLW_CLASS_TCB  ptcb, PLW_STACK  pstk)
{
#if LW_CFG_MODULELOADER_EN > 0
    vprocStackFree(ptcb, (PVOID)pstk);
#else
    __KHEAP_FREE((PVOID)pstk);
#endif                                                                  /*  LW_CFG_MODULELOADER_EN > 0  */
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
