/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: armMpu.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2017 年 11 月 08 日
**
** 描        述: ARM 体系构架 MPU 驱动.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "SylixOS.h"
/*********************************************************************************************************
  裁剪支持
*********************************************************************************************************/
#if (LW_CFG_VMM_EN == 0) && (LW_CFG_ARM_MPU > 0)
#include "mpu/v7m/armMpuV7M.h"
#include "mpu/v7r/armMpuV7R.h"
/*********************************************************************************************************
** 函数名称: archMpuInit
** 功能描述: 初始化 MPU
** 输　入  : pcMachineName  机器名称
**           pmpuregion     内存分区信息
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  archMpuInit (CPCHAR  pcMachineName, const ARM_MPU_REGION  mpuregion[])
{
#if defined(__SYLIXOS_ARM_ARCH_M__)
    armMpuV7MInit(pcMachineName, mpuregion);

#elif defined(__SYLIXOS_ARM_ARCH_R__)
    armMpuV7RInit(pcMachineName, mpuregion);
#endif                                                                  /*  __SYLIXOS_ARM_ARCH_R__      */
}

#endif                                                                  /*  LW_CFG_ARM_MPU > 0          */
/*********************************************************************************************************
  END
*********************************************************************************************************/
