/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: armVfpV7M.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2017 年 11 月 08 日
**
** 描        述: ARM 体系架构 Cortex-Mx VFPv4/5 支持.
*********************************************************************************************************/

#ifndef __ARMVFPV7M_H
#define __ARMVFPV7M_H

PARM_FPU_OP  armVfpV7MPrimaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);
VOID         armVfpV7MSecondaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);

#endif                                                                  /*  __ARMVFPV7M_H               */
/*********************************************************************************************************
  END
*********************************************************************************************************/
