/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: treeType.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2008 年 12 月 17 日
**
** 描        述: 这是系统使用的所有树类型定义。
*********************************************************************************************************/

#ifndef __TREETYPE_H
#define __TREETYPE_H

/*********************************************************************************************************
  红黑树类型 (from linux)
*********************************************************************************************************/

typedef struct __tree_rb_node {
    struct __tree_rb_node   *TRBN_ptrbnParent;                          /*  父亲节点                    */
    struct __tree_rb_node   *TRBN_ptrbnLeft;                            /*  左儿子节点                  */
    struct __tree_rb_node   *TRBN_ptrbnRight;                           /*  右儿子节点                  */
    INT                      TRBN_iColor;                               /*  节点颜色                    */
#define LW_TREE_RB_RED       0                                          /*  红色节点                    */
#define LW_TREE_RB_BLACK     1                                          /*  黑色节点                    */
} LW_TREE_RB_NODE;
typedef LW_TREE_RB_NODE     *PLW_TREE_RB_NODE;                          /*  节点指针                    */

typedef struct __tree_rb_root {
    PLW_TREE_RB_NODE         TRBR_ptrbnNode;                            /*  根节点                      */
} LW_TREE_RB_ROOT;
typedef LW_TREE_RB_ROOT     *PLW_TREE_RB_ROOT;                          /*  树根指针                    */

#endif                                                                  /*  __TREETYPE_H                */
/*********************************************************************************************************
  END
*********************************************************************************************************/
