/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: lwip_iac.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2009 年 07 月 13 日
**
** 描        述: lwip iac 命令工具.
*********************************************************************************************************/

#ifndef __LW_IAC_H
#define __LW_IAC_H

/*********************************************************************************************************
  IAC 命令
*********************************************************************************************************/

#define LW_IAC_EOF                  236                                 /*  文件结束符                  */
#define LW_IAC_SUSP                 237                                 /*  挂起当前进程                */
#define LW_IAC_ABORT                238                                 /*  异常中止进程                */
#define LW_IAC_EOR                  239                                 /*  记录结束符                  */
#define LW_IAC_SE                   240                                 /*  子选项结束                  */
#define LW_IAC_NOP                  241                                 /*  无操作                      */
#define LW_IAC_DM                   242                                 /*  数据标记                    */
#define LW_IAC_BRK                  243                                 /*  中断                        */
#define LW_IAC_IP                   244                                 /*  中断进程                    */
#define LW_IAC_AO                   245                                 /*  异常中止输出                */
#define LW_IAC_AYT                  246                                 /*  对方是否在运行              */
#define LW_IAC_EC                   247                                 /*  转义字符                    */
#define LW_IAC_EL                   248                                 /*  删除行                      */
#define LW_IAC_GA                   249                                 /*  继续进行                    */
#define LW_IAC_SB                   250                                 /*  子选项开始                  */
#define LW_IAC_IAC                  255                                 /*  IAC                         */

/*********************************************************************************************************
  IAC 协商
  
1: WILL   ---->
          <----   DO     (同意)
2: WILL   ---->
          <----   DONT   (不同意)
          
3: DO     ---->
          <----   WILL   (同意)
4: DO     ---->
          <----   WONT   (不同意)

5: WONT   ---->
          <----   DONT   (接收方必须同意)
6: DONT   ---->
          <----   WONT   (接收方必须同意)
*********************************************************************************************************/

#define LW_IAC_WILL                 251                                 /*  发送方想激活的选项          */
#define LW_IAC_WONT                 252                                 /*  发送方想禁止的选项          */
#define LW_IAC_DO                   253                                 /*  发送方想让接收方激活选项    */
#define LW_IAC_DONT                 254                                 /*  发送方想让接收方禁止选项    */

/*********************************************************************************************************
  自定义 IAC 命令
*********************************************************************************************************/

#define LW_IAC_USER_SDK             101                                 /*  关闭颜色显示和回显          */

/*********************************************************************************************************
  IAC 选项标识
*********************************************************************************************************/

#define LW_IAC_OPT_ECHO             1                                   /*  回显                        */
#define LW_IAC_OPT_SGA              3                                   /*  抑制继续进行                */
#define LW_IAC_OPT_STATUS           5                                   /*  状态                        */
#define LW_IAC_OPT_TM               6                                   /*  定时标记                    */
#define LW_IAC_OPT_TTYPE            24                                  /*  终端类型                    */
#define LW_IAC_OPT_NAWS             31                                  /*  窗口大小                    */
#define LW_IAC_OPT_TSPEED           32                                  /*  端口速率                    */
#define LW_IAC_OPT_LFLOW            33                                  /*  远程流量控制                */
#define LW_IAC_OPT_LINEMODE         34                                  /*  行方式                      */
#define LW_IAC_OPT_OLD_ENVIRON      36                                  /*  环境变量                    */

/*********************************************************************************************************
  IAC 基本操作函数
*********************************************************************************************************/

INT    __inetIacMakeFrame(INT  iCommand, INT  iOpt, PCHAR  pcBuffer);
INT    __inetIacSend(INT  iFd, INT  iCommand, INT  iOpt);
PCHAR  __inetIacFilter(PCHAR        pcBuffer, 
                       INT          iLen, 
                       INT         *piPtyLen, 
                       INT         *piProcessLen, 
                       FUNCPTR      pfunc,
                       PVOID        pvArg);

#endif                                                                  /*  __LW_IAC_H                  */
/*********************************************************************************************************
  END
*********************************************************************************************************/
