/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: ppcVfpNone.c
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2015 年 12 月 15 日
**
** 描        述: PowerPC 体系架构无 VFP 支持.
*********************************************************************************************************/
#define  __SYLIXOS_STDIO
#define  __SYLIXOS_KERNEL
#include "SylixOS.h"
/*********************************************************************************************************
  裁剪支持
*********************************************************************************************************/
#if LW_CFG_CPU_FPU_EN > 0
#include "../ppcFpu.h"
/*********************************************************************************************************
  全局变量
*********************************************************************************************************/
static PPC_FPU_OP   _G_fpuopVfpNone;
/*********************************************************************************************************
** 函数名称: ppcVfpNoneEnable
** 功能描述: 使能 VFP
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  ppcVfpNoneEnable (VOID)
{
}
/*********************************************************************************************************
** 函数名称: ppcVfpNoneDisable
** 功能描述: 禁能 VFP
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  ppcVfpNoneDisable (VOID)
{
}
/*********************************************************************************************************
** 函数名称: ppcVfpNoneIsEnable
** 功能描述: 是否使能了 VFP
** 输　入  : NONE
** 输　出  : 是否使能
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static BOOL  ppcVfpNoneIsEnable (VOID)
{
    return  (LW_TRUE);
}
/*********************************************************************************************************
** 函数名称: ppcVfpNoneSave
** 功能描述: 保存 VFP 上下文
** 输　入  : pvFpuCtx  VFP 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  ppcVfpNoneSave (PVOID  pvFpuCtx)
{
}
/*********************************************************************************************************
** 函数名称: ppcVfpNoneRestore
** 功能描述: 恢复 VFP 上下文
** 输　入  : pvFpuCtx  VFP 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  ppcVfpNoneRestore (PVOID  pvFpuCtx)
{
}
/*********************************************************************************************************
** 函数名称: ppcVfpNoneCtxShow
** 功能描述: 显示 VFP 上下文
** 输　入  : iFd       输出文件描述符
**           pvFpuCtx  VFP 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  ppcVfpNoneCtxShow (INT  iFd, PVOID  pvFpuCtx)
{
#if (LW_CFG_DEVICE_EN > 0) && (LW_CFG_FIO_LIB_EN > 0)
    fdprintf(iFd, "no vfp\n");
#endif
}
/*********************************************************************************************************
** 函数名称: ppcVfpNoneEnableTask
** 功能描述: 系统发生 undef 异常时, 使能任务的 VFP
** 输　入  : ptcbCur    当前任务控制块
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
static VOID  ppcVfpNoneEnableTask (PLW_CLASS_TCB  ptcbCur)
{
}
/*********************************************************************************************************
** 函数名称: ppcVfpNonePrimaryInit
** 功能描述: 获取 VFP 控制器操作函数集
** 输　入  : pcMachineName 机器名
** 输　出  : 操作函数集
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
PPPC_FPU_OP  ppcVfpNonePrimaryInit (CPCHAR  pcMachineName, CPCHAR  pcFpuName)
{
    _G_fpuopVfpNone.PFPU_pfuncEnable     = ppcVfpNoneEnable;
    _G_fpuopVfpNone.PFPU_pfuncDisable    = ppcVfpNoneDisable;
    _G_fpuopVfpNone.PFPU_pfuncIsEnable   = ppcVfpNoneIsEnable;
    _G_fpuopVfpNone.PFPU_pfuncSave       = ppcVfpNoneSave;
    _G_fpuopVfpNone.PFPU_pfuncRestore    = ppcVfpNoneRestore;
    _G_fpuopVfpNone.PFPU_pfuncCtxShow    = ppcVfpNoneCtxShow;
    _G_fpuopVfpNone.PFPU_pfuncEnableTask = ppcVfpNoneEnableTask;

    return  (&_G_fpuopVfpNone);
}
/*********************************************************************************************************
** 函数名称: ppcVfpNoneSecondaryInit
** 功能描述: 初始化 VFP 控制器
** 输　入  : pcMachineName 机器名
**           pcFpuName     浮点运算器名
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  ppcVfpNoneSecondaryInit (CPCHAR  pcMachineName, CPCHAR  pcFpuName)
{
    (VOID)pcMachineName;
    (VOID)pcFpuName;
}

#endif                                                                  /*  LW_CFG_CPU_FPU_EN > 0       */
/*********************************************************************************************************
  END
*********************************************************************************************************/
