/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: ppcVfpNone.h
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2015 年 12 月 15 日
**
** 描        述: PowerPC 体系架构无 VFP 支持.
*********************************************************************************************************/

#ifndef __ARCH_PPCVFPNONE_H
#define __ARCH_PPCVFPNONE_H

PPPC_FPU_OP  ppcVfpNonePrimaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);
VOID         ppcVfpNoneSecondaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);

#endif                                                                  /*  __ARCH_PPCVFPNONE_H         */
/*********************************************************************************************************
  END
*********************************************************************************************************/
