/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: eventfdDev.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2013 年 11 月 20 日
**
** 描        述: Linux 兼容 eventfd 实现.
*********************************************************************************************************/

#ifndef __EVENTFDDEV_H
#define __EVENTFDDEV_H

/*********************************************************************************************************
  裁剪控制
*********************************************************************************************************/
#if (LW_CFG_DEVICE_EN > 0) && (LW_CFG_EVENTFD_EN > 0)

/*********************************************************************************************************
  设备路径
*********************************************************************************************************/

#define LW_EVTFD_DEV_PATH   "/dev/eventfd"

/*********************************************************************************************************
  设备与文件结构
*********************************************************************************************************/

typedef struct {
    LW_DEV_HDR          ED_devhdrHdr;                                   /*  设备头                      */
} LW_EVTFD_DEV;
typedef LW_EVTFD_DEV   *PLW_EVTFD_DEV;

typedef struct {
    INT                 EF_iFlag;                                       /*  打开文件的选项              */
    LW_OBJECT_HANDLE    EF_ulReadLock;
    LW_OBJECT_HANDLE    EF_ulWriteLock;
    UINT64              EF_u64Counter;
    LW_SEL_WAKEUPLIST   EF_selwulist;
    LW_SPINLOCK_DEFINE (EF_slLock);
} LW_EVTFD_FILE;
typedef LW_EVTFD_FILE  *PLW_EVTFD_FILE;

/*********************************************************************************************************
  初始化操作
*********************************************************************************************************/

LW_API INT  API_EventfdDrvInstall(VOID);
LW_API INT  API_EventfdDevCreate(VOID);

#define eventfdDrv          API_EventfdDrvInstall
#define eventfdDevCreate    API_EventfdDevCreate

#endif                                                                  /*  LW_CFG_DEVICE_EN > 0        */
                                                                        /*  LW_CFG_EVENTFD_EN > 0       */
#endif                                                                  /*  __EVENTFDDEV_H              */
/*********************************************************************************************************
  END
*********************************************************************************************************/
