/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: gjb_fsrel.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2016 年 04 月 13 日
**
** 描        述: GJB7714 扩展接口文件系统相关部分.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "SylixOS.h"
/*********************************************************************************************************
  裁剪支持
*********************************************************************************************************/
#if (LW_CFG_POSIX_EN > 0) && (LW_CFG_GJB7714_EN > 0)
#include "../include/px_gjbext.h"
/*********************************************************************************************************
** 函数名称: gjb_mount
** 功能描述: 挂载文件系统.
** 输　入  : fs                文件系统类型
**           dev               设备
**           mpath             挂载目标
** 输　出  : ERROR or OK
** 全局变量: 
** 调用模块: 
                                           API 函数
*********************************************************************************************************/
LW_API 
int  gjb_mount (const char *fs, const char *dev, const char *mpath)
{
    return  (API_MountEx(dev, mpath, fs, "rw"));
}
/*********************************************************************************************************
** 函数名称: gjb_umount
** 功能描述: 卸载文件系统.
** 输　入  : mpath             挂载点
** 输　出  : ERROR or OK
** 全局变量: 
** 调用模块: 
                                           API 函数
*********************************************************************************************************/
LW_API 
int  gjb_umount (const char *mpath)
{
    return  (API_Unmount(mpath));
}
/*********************************************************************************************************
** 函数名称: gjb_format
** 功能描述: 格式化文件系统.
** 输　入  : fs                文件系统
**           dev               设备路径
** 输　出  : ERROR or OK
** 全局变量: 
** 调用模块: 
                                           API 函数
*********************************************************************************************************/
LW_API 
int  gjb_format (const char *fs, const char *dev)
{
    if (!dev) {
        errno = EINVAL;
        return  (PX_ERROR);
    }

    return  (diskformat(dev));
}
/*********************************************************************************************************
** 函数名称: gjb_cat
** 功能描述: 显示指定文件的内容.
** 输　入  : pathname          文件路径
** 输　出  : ERROR or OK
** 全局变量: 
** 调用模块: 
                                           API 函数
*********************************************************************************************************/
LW_API 
int  gjb_cat (char *pathname)
{
    INT         iFd;
    ssize_t     sstNum;
    CHAR        cBuffer[1024];
    struct stat statGet;
    
    if (!pathname) {
        errno = EINVAL;
        return  (PX_ERROR);
    }
    
    iFd = open(pathname, O_RDONLY);
    if (iFd < 0) {
        return  (PX_ERROR);
    }
    
    if (fstat(iFd, &statGet) < 0) {
        close(iFd);
        return  (PX_ERROR);
    }
    
    if (S_ISDIR(statGet.st_mode)) {
        close(iFd);
        errno = EISDIR;
        return  (PX_ERROR);
    }
    
    do {
        sstNum = read(iFd, cBuffer, sizeof(cBuffer));
        if (sstNum > 0) {
            write(1, cBuffer, (size_t)sstNum);
        }
    } while (sstNum > 0);
    
    close(iFd);
    
    return  (ERROR_NONE);
}

#endif                                                                  /*  LW_CFG_POSIX_EN > 0         */
                                                                        /*  LW_CFG_GJB7714_EN > 0       */
/*********************************************************************************************************
  END
*********************************************************************************************************/
