/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: fatfs_cfg.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2008 年 09 月 21 日
**
** 描        述: 文件系统配置
*********************************************************************************************************/

#ifndef __FS_CFG_H
#define __FS_CFG_H

/*********************************************************************************************************
*                               磁盘 RAW I/O 支持
*  依存关系: 1: I/O 系统
*********************************************************************************************************/

#define LW_CFG_BLKRAW_EN                    1                           /*  是否需要 block raw I/O 支持 */

/*********************************************************************************************************
*                               综合管理
*  依存关系: 1: RTC 服务
             2: I/O 系统
*********************************************************************************************************/

#define LW_CFG_MAX_VOLUMES                  20                          /*  系统同时支持的卷的数量      */
                                                                        /*  MAX 255                     */
                                                                        
#define LW_CFG_MAX_DISKPARTS                10                          /*  每个物理磁盘支持的最大逻辑  */
                                                                        /*  分区数量, (包含扩展分区)    */
                                                                        /*  常见于硬盘等大容量设备      */
                                                                        
#define LW_CFG_TMP_PATH                     "/tmp/"                     /*  配合 stdio 的临时文件夹     */
                                                                        /*  注意, 以 "/" 结尾           */
                                                                        /*  建议不要修改这个配置, 在BSP */
                                                                        /*  初始化时, 创建符号链接来指定*/
                                                                        /*  例如: symlink(..., "/tmp"); */
/*********************************************************************************************************
*                               介质无关扇区高速缓冲配置
*  依存关系: 1: 互斥信号量
*********************************************************************************************************/

#define LW_CFG_DISKCACHE_EN                 1                           /*  是否允许磁盘缓冲            */
#define LW_CFG_DISKCACHE_MAX_PIPELINE       4                           /*  最大并行写管线线程数        */
#define LW_CFG_DISKCACHE_OPTION             LW_OPTION_THREAD_STK_CHK    /*  磁盘缓冲服务线程选项        */
                                                                        /*  注意: 磁盘缓冲背景线程不使用*/
                                                                        /*  线程硬件浮点堆栈            */
/*********************************************************************************************************
*                               磁盘分区管理
*  依存关系: 1: 互斥信号量
*********************************************************************************************************/

#define LW_CFG_DISKPART_EN                  1                           /*  是否允许磁盘分区管理        */

/*********************************************************************************************************
*                               软件 RAID 磁盘阵列管理
*  依存关系: 1: 互斥信号量
             2: I/O 系统
*********************************************************************************************************/

#define LW_CFG_DISKRAID_EN                  1                           /*  是否使能软件 RAID 管理      */

/*********************************************************************************************************
*                               磁盘自动挂载工具
*  依存关系: 1: 磁盘 CACHE
             2: 磁盘分区管理
*********************************************************************************************************/

#define LW_CFG_OEMDISK_EN                   1                           /*  是否需要自动挂载与分区工具  */

/*********************************************************************************************************
*                               FAT 文件系统 (兼容 MS-DOS FAT12/16/32) 配置. 
*  依存关系: 1: 互斥信号量
             2: I/O 系统
             3: RTC 服务
*********************************************************************************************************/

#define LW_CFG_FATFS_EN                     1                           /*  是否允许小型 FAT 文件系统   */
#define LW_CFG_FATFS_NFATS                  2                           /*  格式化时, 磁盘使用的 FAT 表 */
                                                                        /*  备份数量 (数据损坏恢复使用) */
                                                                        /*  必须大于零                  */
                                                                        
#define LW_CFG_FATFS_CODE                   936                         /*  长文件名编码转换            */
                                                                        /*  FAT 使用 unicode 保存文件名 */
                                                                        /*  这里可以设置转换为指定的编码*/
                                                                        /*  -1 表示不需要转码           */
/*********************************************************************************************************
  码表说明如下:
    437  - U.S.
    720  - Arabic
    1256 - Arabic (Windows)
    737  - Greek
    1253 - Greek (Windows)
    1250 - Central Europe (Windows)
    775  - Baltic
    1257 - Baltic (Windows)
    850  - Multilingual Latin 1
    852  - Latin 2
    1252 - Latin 1 (Windows)
    855  - Cyrillic
    1251 - Cyrillic (Windows)
    857  - Turkish
    1254 - Turkish (Windows)
    858  - Multilingual Latin 1 + Euro
    862  - Hebrew
    1255 - Hebrew (Windows)
    866  - Russian
    874  - Thai
    932  - Japanese Shift-JIS       (DBCS)
    936  - Simplified Chinese GBK   (DBCS)
    949  - Korean                   (DBCS)
    950  - Traditional Chinese Big5 (DBCS)
    1258 - Vietnam
    Baltic
*********************************************************************************************************/
/*********************************************************************************************************
*                               NFS 网络文件系统配置. 
*  依存关系: 1: 网络
             2: RPC
             2: I/O 系统
*********************************************************************************************************/

#define LW_CFG_NFS_EN                       1                           /*  是否使能 NFS 文件系统服务   */

/*********************************************************************************************************
*                               yaffs2 写平衡文件系统配置
*  依存关系: 1: 互斥信号量
             2: I/O 系统
             3: RTC 服务
             4: region 服务
*********************************************************************************************************/

#define LW_CFG_YAFFS_EN                     1                           /*  是否允许 YAFFS 文件系统     */
#define LW_CFG_YAFFS_NOR_EN                 1                           /*  是否提供 nor flash 支持     */
#define LW_CFG_YAFFS_MAX_FILES              100                         /*  可以同时打开的 YAFFS 文件数 */

#define LW_CFG_YAFFS_UNMOUNT_VOL            1                           /*  卸载 YAFFS 卷时 unmount 操作*/

/*********************************************************************************************************
*                               TPSFS (True Power Safe) 文件系统
*  依存关系: 1: I/O 系统
*********************************************************************************************************/

#define LW_CFG_TPSFS_EN                     1                           /*  是否需要 TPSFS 支持         */

/*********************************************************************************************************
*                               proc 文件系统
*  依存关系: 1: 互斥信号量
             2: I/O 系统
             3: RTC 服务
*********************************************************************************************************/

#define LW_CFG_PROCFS_EN                    1                           /*  是否允许 proc 文件系统      */
#define LW_CFG_PROCFS_KERNEL_INFO           1                           /*  是否需要内核信息文件        */
#define LW_CFG_PROCFS_SYSTEM_INFO           1                           /*  是否需要系统信息文件        */
#define LW_CFG_PROCFS_HOOK_INFO             1                           /*  是否需要 hook 信息文件      */
#define LW_CFG_PROCFS_BSP_INFO              1                           /*  是否需要BSP信息文件         */

/*********************************************************************************************************
*                               ram 文件系统
*  依存关系: 1: 互斥信号量
             2: I/O 系统
             
*  注  意  : LW_CFG_RAMFS_VMM_EN 目前不能设置为 1 否则 VMM 缺页中断可能造成 SylixOS 内核死锁.
*********************************************************************************************************/

#define LW_CFG_RAMFS_EN                     1                           /*  是否允许 ram 文件系统       */
#define LW_CFG_RAMFS_VMM_EN                 0                           /*  是否使用 VMM 开辟内存       */
                                                                        /*  否则使用系统堆开辟内存      */

/*********************************************************************************************************
*                               rom 文件系统
*  依存关系: 1: 互斥信号量
             2: I/O 系统
*********************************************************************************************************/

#define LW_CFG_ROMFS_EN                     1                           /*  是否允许 rom 文件系统       */

/*********************************************************************************************************
*                               mount 管理 (详细情况见 blockIo.h 文件系统设备说明)
*  依存关系: 1: RTC 服务
             2: I/O 系统
             3: FAT 文件系统
             4: shell 系统
             5: BLK RAW 服务
*********************************************************************************************************/

#define LW_CFG_MOUNT_EN                     1                           /*  是否需要 mount 工具         */

#endif                                                                  /*  __FS_CFG_H                  */
/*********************************************************************************************************
  END
*********************************************************************************************************/
