/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: Lw_Api_Loader.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2010 年 05 月 13 日
**
** 描        述: 这是系统提供给 C / C++ 用户的内核应用程序接口层。
                 为了适应不同语言习惯的人，这里使用了很多重复功能.
*********************************************************************************************************/

#ifndef __LW_API_LOADER_H
#define __LW_API_LOADER_H

/*********************************************************************************************************
  基本装载器操作
*********************************************************************************************************/

#define Lw_Module_Status        API_ModuleStatus
#define Lw_Module_Load          API_ModuleLoad
#define Lw_Module_LoadEx        API_ModuleLoadEx
#define Lw_Module_Unload        API_ModuleUnload
#define Lw_Module_Sym           API_ModuleSym
#define Lw_Module_Times         API_ModuleTimes

#endif                                                                  /*  __LW_API_LOADER_H           */
/*********************************************************************************************************
  END
*********************************************************************************************************/
