/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: Lw_Class_System.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2006 年 12 月 14 日
**
** 描        述: 这是系统提供给 C / C++ 用户的系统对象类型层。用于 Lw_Object_GetClass 返回判断
*********************************************************************************************************/

#ifndef __LW_CLASS_SYSTEM_H
#define __LW_CLASS_SYSTEM_H

#define LW_OBJECT_CLASS_THREAD_POOL           _OBJECT_THREAD_POOL       /*  线程池                      */
#define LW_OBJECT_CLASS_POWERM                _OBJECT_POWERM            /*  功耗管理器                  */

#endif                                                                  /*  __LW_CLASS_SYSTEM_H         */
/*********************************************************************************************************
  END
*********************************************************************************************************/
