/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: Lw_Class_Mp.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2007 年 04 月 10 日
**
** 描        述: 这是系统提供给 C / C++ 用户的系统对象类型层。用于 Lw_Object_GetClass 返回判断
*********************************************************************************************************/

#ifndef __LW_CLASS_MP_H
#define __LW_CLASS_MP_H

#define LW_OBJECT_CLASS_DPMA                  _OBJECT_DPMA
#define LW_OBJECT_CLASS_MPSEM                 _OBJECT_MPSEM
#define LW_OBJECT_CLASS_MPMSGQUEUE            _OBJECT_MPMSGQUEUE

#endif                                                                  /*  __LW_CLASS_MP_H             */
/*********************************************************************************************************
  END
*********************************************************************************************************/
