/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: armCacheV6.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2013 年 12 月 09 日
**
** 描        述: ARMv6 体系构架 CACHE 驱动.
*********************************************************************************************************/

#ifndef __ARMCACHEV6_H
#define __ARMCACHEV6_H

VOID  armCacheV6Init(LW_CACHE_OP *pcacheop, 
                     CACHE_MODE   uiInstruction, 
                     CACHE_MODE   uiData, 
                     CPCHAR       pcMachineName);
                      
VOID  armCacheV6Reset(CPCHAR  pcMachineName);

#endif                                                                  /*  __ARMCACHEV6_H              */
/*********************************************************************************************************
  END
*********************************************************************************************************/
