/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: mipsVfp32.h
**
** 创   建   人: Ryan.Xin (信金龙)
**
** 文件创建日期: 2015 年 11 月 17 日
**
** 描        述: MIPS 体系架构 VPU32 支持.
*********************************************************************************************************/

#ifndef __MIPSVFP32_H
#define __MIPSVFP32_H

PMIPS_FPU_OP  mipsVfp32PrimaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);
VOID          mipsVfp32SecondaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);

#endif                                                                  /*  __MIPSVFP32_H               */
/*********************************************************************************************************
  END
*********************************************************************************************************/
