/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: nfs_sylixos.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2012 年 03 月 08 日
**
** 描        述: nfs 文件系统 sylixos 接口.
*********************************************************************************************************/

#ifndef __NFS_SYLIXOS_H
#define __NFS_SYLIXOS_H

/*********************************************************************************************************
  裁剪宏
*********************************************************************************************************/
#if (LW_CFG_MAX_VOLUMES > 0) && (LW_CFG_NFS_EN > 0)

/*********************************************************************************************************
  API
  注意: API_NfsDevCreate() 仅使用 pblkd->BLKD_pcName 作为 host 标示. 不使用块设备操作函数.
*********************************************************************************************************/
LW_API INT      API_NfsDrvInstall(VOID);
LW_API INT      API_NfsDevCreate(PCHAR   pcName, PLW_BLK_DEV  pblkd);
LW_API INT      API_NfsDevDelete(PCHAR   pcName);

#define nfsDrv                API_NfsDrvInstall
#define nfsDevCreate          API_NfsDevCreate
#define nfsDevDelete          API_NfsDevDelete

#endif                                                                  /*  (LW_CFG_MAX_VOLUMES > 0)    */
                                                                        /*  (LW_CFG_NFS_EN > 0)         */
#endif                                                                  /*  __NFS_SYLIXOS_H             */
/*********************************************************************************************************
  END
*********************************************************************************************************/
