/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: x86Cache.h
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2016 年 07 月 18 日
**
** 描        述: x86 体系构架 CACHE 驱动.
*********************************************************************************************************/

#ifndef __ARCH_X86CACHE_H
#define __ARCH_X86CACHE_H

VOID  x86CacheInit(LW_CACHE_OP *pcacheop,
                   CACHE_MODE   uiInstruction,
                   CACHE_MODE   uiData,
                   CPCHAR       pcMachineName);
                      
VOID  x86CacheReset(CPCHAR  pcMachineName);

#endif                                                                  /*  __ARCH_X86CACHE_H           */
/*********************************************************************************************************
  END
*********************************************************************************************************/
