/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: time.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2010 年 01 月 07 日
**
** 描        述: 系统扩展时间库.
*********************************************************************************************************/

#ifndef __SYS_TIME_H
#define __SYS_TIME_H

#include "types.h"
#include "../time.h"

/*********************************************************************************************************
  定时器类型
*********************************************************************************************************/

#define ITIMER_REAL     0
#define ITIMER_VIRTUAL  1
#define ITIMER_PROF     2

/*********************************************************************************************************
  宏操作
*********************************************************************************************************/

#define	timerisset(tvp)		((tvp)->tv_sec || (tvp)->tv_usec)
#define	timerclear(tvp)		((tvp)->tv_sec = (tvp)->tv_usec = 0)
#define	timercmp(a, b, CMP) \
    (((a)->tv_sec == (b)->tv_sec) ? \
     ((a)->tv_usec CMP (b)->tv_usec) :  \
     ((a)->tv_sec CMP (b)->tv_sec))
#define	timeradd(a, b, result)  \
    do {  \
        (result)->tv_sec = (a)->tv_sec + (b)->tv_sec;   \
        (result)->tv_usec = (a)->tv_usec + (b)->tv_usec;    \
        if ((result)->tv_usec >= 1000000) { \
	        ++(result)->tv_sec; \
	        (result)->tv_usec -= 1000000;   \
        } \
    } while (0)
#define	timersub(a, b, result)  \
    do {  \
        (result)->tv_sec = (a)->tv_sec - (b)->tv_sec;   \
        (result)->tv_usec = (a)->tv_usec - (b)->tv_usec;    \
        if ((result)->tv_usec < 0) {    \
            --(result)->tv_sec;   \
            (result)->tv_usec += 1000000; \
        }   \
    } while (0)

#endif                                                                  /*  __SYS_TIME_H                */
/*********************************************************************************************************
  END
*********************************************************************************************************/
