/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: uuid.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2013 年 04 月 24 日
**
** 描        述: uuid.
*********************************************************************************************************/

#ifndef __SYS_UUID_H
#define __SYS_UUID_H

#include "cdefs.h"
#include "types.h"

/*********************************************************************************************************
  Length of a node address (an IEEE 802 address). 
*********************************************************************************************************/

#define	_UUID_NODE_LEN		6

/*********************************************************************************************************
  Length of a printed UUID.
*********************************************************************************************************/

#define	_UUID_STR_LEN		38

/*********************************************************************************************************
 * See also:
 *      http://www.opengroup.org/dce/info/draft-leach-uuids-guids-01.txt
 *      http://www.opengroup.org/onlinepubs/009629399/apdxa.htm
 * A DCE 1.1 compatible source representation of UUIDs.
*********************************************************************************************************/

struct uuid {
	uint32_t	time_low;
	uint16_t	time_mid;
	uint16_t	time_hi_and_version;
	uint8_t		clock_seq_hi_and_reserved;
	uint8_t		clock_seq_low;
	uint8_t		node[_UUID_NODE_LEN];
} __attribute__((packed));

typedef struct uuid uuid_t;

__BEGIN_DECLS
int	uuidgen(struct uuid *store, int cnt);
__END_DECLS

#endif                                                                  /*  __SYS_UUID_H                */
/*********************************************************************************************************
  END
*********************************************************************************************************/
