/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: lib_lldiv.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2008 年 08 月 30 日
**
** 描        述: 64 位除法, 64 位时间运算需要.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
/*********************************************************************************************************
** 函数名称: lib_div
** 功能描述: 
** 输　入  : 
** 输　出  : 
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
lib_div_t       lib_div(int  numer, int  denom)
{
    lib_div_t result;

    result.quot = numer / denom;
    result.rem = numer % denom;
    
    if (numer >= 0 && result.rem < 0) {
        result.quot++;
        result.rem -= denom;
    }
    
    return  (result);
}
/*********************************************************************************************************
** 函数名称: lib_ldiv
** 功能描述: 
** 输　入  : 
** 输　出  : 
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
lib_ldiv_t      lib_ldiv(long  numer, long  denom)
{
    lib_ldiv_t result;

    result.quot = numer / denom;
    result.rem = numer % denom;
    
    if (numer >= 0 && result.rem < 0) {
        result.quot++;
        result.rem -= denom;
    }
    
    return  (result);
}
/*********************************************************************************************************
** 函数名称: lib_lldiv
** 功能描述: 
** 输　入  : 
** 输　出  : 
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
lib_lldiv_t lib_lldiv (INT64  numer, INT64  denom)
{
    lib_lldiv_t result;

    result.quot = numer / denom;
    result.rem = numer % denom;

    if (numer >= 0 && result.rem < 0) {
        result.quot++;
        result.rem -= denom;
    }

    return result;
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
