/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: lib_system.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2008 年 08 月 30 日
**
** 描        述: 系统库.

** BUG:
2010.10.06  加入对 cancel type 的操作, 符合 POSIX 标准.
2013.01.15  abort 应该使用 _exit() 调用.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
#include "../SylixOS/system/include/s_system.h"
#include "../SylixOS/shell/include/ttiny_shell.h"
/*********************************************************************************************************
** 函数名称: lib_abort
** 功能描述: 
** 输　入  : 
** 输　出  : 
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  lib_abort (VOID)
{
#if LW_CFG_SIGNAL_EN > 0
    raise(SIGABRT);
#endif                                                                  /*  LW_CFG_SIGNAL_EN > 0        */
    
    _exit(EXIT_FAILURE);
}
/*********************************************************************************************************
** 函数名称: lib_system
** 功能描述: 
** 输　入  : 
** 输　出  : 
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
INT  lib_system (CPCHAR  pcCmd)
{
#if LW_CFG_SHELL_EN > 0
    INT     iRet;
    
    if (!pcCmd) {
        _ErrorHandle(EINVAL);
        return  (PX_ERROR);
    }
    
    __THREAD_CANCEL_POINT();                                            /*  测试取消点                  */
    
    iRet = API_TShellExec(pcCmd);

    return  (iRet);
#else
    return  (PX_ERROR);
#endif                                                                  /*  LW_CFG_SHELL_EN > 0         */
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
