/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: lwip_ping.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2009 年 05 月 06 日
**
** 描        述: lwip ping 工具. (相关源码来源于 contrib)
*********************************************************************************************************/

#ifndef __LWIP_PING_H
#define __LWIP_PING_H

/*********************************************************************************************************
  裁剪控制
*********************************************************************************************************/
#if (LW_CFG_NET_EN > 0) && (LW_CFG_NET_PING_EN > 0)

LW_API VOID     API_INetPingInit(VOID);

#define inetPingInit        API_INetPingInit

#ifdef __LWIP_INET_H__                                                  /*  include inet.h              */
struct in_addr;
LW_API INT      API_INetPing(struct in_addr *pinaddr, 
                             INT             iTimes, 
                             INT             iDataSize, 
                             INT             iTimeout, 
                             INT             iTTL);
#define inetPing        API_INetPing
#endif                                                                  /*  __LWIP_INET_H__             */

#endif                                                                  /*  (LW_CFG_NET_EN > 0)         */
                                                                        /*  (LW_CFG_NET_PING_EN > 0)    */
#endif                                                                  /*  __LWIP_PING_H               */
/*********************************************************************************************************
  END
*********************************************************************************************************/
