/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: sparcVfpNone.h
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2017 年 09 月 26 日
**
** 描        述: SPARC 体系架构无 VFP 支持.
*********************************************************************************************************/

#ifndef __ARCH_SPARC_VFP_NONE_H
#define __ARCH_SPARC_VFP_NONE_H

PSPARC_FPU_OP  sparcVfpNonePrimaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);
VOID           sparcVfpNoneSecondaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);

#endif                                                                  /*  __ARCH_SPARC_VFP_NONE_H     */
/*********************************************************************************************************
  END
*********************************************************************************************************/
