/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: unique.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2013 年 01 月 08 日
**
** 描        述: 为没有 inode 序列号的文件系统提供序列号支持, 例如 FAT SMB 等.
*********************************************************************************************************/

#ifndef  __UNIQUE_H
#define  __UNIQUE_H

/*********************************************************************************************************
  裁剪宏
*********************************************************************************************************/
#if (LW_CFG_MAX_VOLUMES > 0) && (LW_CFG_FATFS_EN > 0)

/*********************************************************************************************************
  inode unique pool
*********************************************************************************************************/
typedef struct {
    ULONG                UNIP_ulIndex;                                  /*  当前 index                  */
    size_t               UNIP_stSize;                                   /*  大小                        */
    ULONG                UNIP_ulResvNo;                                 /*  保留最小值                  */
    PCHAR                UNIP_pcArray;                                  /*  unique 池                   */
} LW_UNIQUE_POOL;
typedef LW_UNIQUE_POOL  *PLW_UNIQUE_POOL;

/*********************************************************************************************************
  API
*********************************************************************************************************/
LW_API PLW_UNIQUE_POOL      API_FsUniqueCreate(size_t  stSize, ULONG  ulResvNo);
LW_API VOID                 API_FsUniqueDelete(PLW_UNIQUE_POOL  punip);
LW_API ULONG                API_FsUniqueAlloc(PLW_UNIQUE_POOL  punip);
LW_API VOID                 API_FsUniqueFree(PLW_UNIQUE_POOL  punip, ULONG  ulNo);
LW_API BOOL                 API_FsUniqueIsVal(PLW_UNIQUE_POOL  punip, ULONG  ulNo);


#endif                                                                  /*  (LW_CFG_MAX_VOLUMES > 0)    */
                                                                        /*  (LW_CFG_FATFS_EN > 0)       */
#endif                                                                  /*  __UNIQUE_H                  */
/*********************************************************************************************************
  END
*********************************************************************************************************/
