/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: vmmSwap.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2011 年 05 月 16 日
**
** 描        述: 平台无关内存交换区管理.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
/*********************************************************************************************************
  加入裁剪支持
*********************************************************************************************************/
#if LW_CFG_VMM_EN > 0
#include "vmmSwap.h"
/*********************************************************************************************************
  交换结构
*********************************************************************************************************/
typedef struct {
    PLW_VMM_PAGE        PAGESWPI_pvmpageVirtual;                        /*  隶属于的虚拟空间            */
    addr_t              PAGESWPI_ulVirtualPageAddr;                     /*  对应虚拟页面地址            */
    pid_t               PAGESWPI_pid;                                   /*  进程 ID (当前没有使用)      */
    
#define __VMM_PAGE_SWAP_STATUS_VALID    1                               /*  页面有效                    */
#define __VMM_PAGE_SWAP_STATUS_LOCK     2                               /*  页面被锁定                  */
    ULONG               PAGESWPI_ulPageStatus;                          /*  页面状态                    */
} LW_VMM_PAGE_SWAP_INDEX;
typedef LW_VMM_PAGE_SWAP_INDEX *PLW_VMM_PAGE_SWAP_INDEX;
/*********************************************************************************************************
  统计变量
*********************************************************************************************************/
static INT64                     _K_i64VmmPageSwapCounter = 0;          /*  物理页面交换次数            */
static INT64                     _K_i64VmmIoErrorCounter = 0;           /*  I/O致命错误次数             */
/*********************************************************************************************************
** 函数名称: __vmmPageSwapIsNeedLoad
** 功能描述: 通过指定的虚拟地址和进程 id 在 swap 中查询是否存在页面并需要装载. 
** 输　入  : pid                        进程号
**           ulVirtualPageAddr          需要查找虚拟地址 (页面对齐)
** 输　出  : 需否需要进行 load 操作
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
BOOL  __vmmPageSwapIsNeedLoad (pid_t  pid, addr_t  ulVirtualPageAddr)
{
    return  (LW_FALSE);
}
/*********************************************************************************************************
** 函数名称: __vmmPageSwapLoad
** 功能描述: 通过指定的虚拟地址和进程 id 在 swap 中查询是否存在页面. 如果存在则将页面内容读出并将此页面在
             swap 中去除.
** 输　入  : pid                        进程号
**           ulDestVirtualPageAddr      需要拷贝的目标虚拟地址
**           ulVirtualPageAddr          需要查找虚拟地址 (页面对齐)
** 输　出  : 只要不是 I/O 错误, 都返回 ERROR_NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
ULONG  __vmmPageSwapLoad (pid_t  pid, addr_t  ulDestVirtualPageAddr, addr_t  ulVirtualPageAddr)
{
    /*
     *  这里没有对 PAGESWPI_ulVirtualPageAddr 进行判断, 
     *  PAGESWPI_ulThread 是为了验证一些进程算法模型. (虚拟地址和进程 ID 联合起来才能确定一个页面)
     */
    
    /*
     *  TODO: 如果确定在 SWAP 中, 则从 SWAP 调入页面数据, 同时将相关页面在 SWAP 中设为无效.
     */
    (VOID)_K_i64VmmIoErrorCounter;
     
    return  (ERROR_NONE);
}
/*********************************************************************************************************
** 函数名称: __vmmPageSwapSwitch
** 功能描述: 产生内存物理页面交换, 将老旧的内存换出同时将页面分配出来.
** 输　入  : pid                        进程号
**           ulPageNum                  需要分配的内存分页数
**           uiAttr                     需要分配的内存分页页面属性
** 输　出  : 通过交换内存, 分配出的页面
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
PLW_VMM_PAGE    __vmmPageSwapSwitch (pid_t  pid, ULONG  ulPageNum, UINT  uiAttr)
{
    (VOID)_K_i64VmmPageSwapCounter;
    
    return  (LW_NULL);
}

#endif                                                                  /*  LW_CFG_VMM_EN > 0           */
/*********************************************************************************************************
  END
*********************************************************************************************************/
