/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: pciCapExt.h
**
** 创   建   人: Gong.YuJian (弓羽箭)
**
** 文件创建日期: 2015 年 10 月 23 日
**
** 描        述: PCI 总线扩展功能管理的延伸.
*********************************************************************************************************/

#ifndef __PCICAPEXT_H
#define __PCICAPEXT_H

/*********************************************************************************************************
  裁剪宏
*********************************************************************************************************/
#if (LW_CFG_DEVICE_EN > 0) && (LW_CFG_PCI_EN > 0)

LW_API VOID     API_PciCapExtShow (INT  iBus, INT  iSlot, INT  iFunc);
LW_API INT      API_PciCapExtFind (INT  iBus, INT  iSlot, INT  iFunc,
                                   UINT8  ucExtCapId, UINT32 *puiOffset);

#define pciCapExtShow           API_PciCapExtShow
#define pciCapExtFind           API_PciCapExtFind

#endif                                                                  /*  (LW_CFG_DEVICE_EN > 0) &&   */
                                                                        /*  (LW_CFG_PCI_EN > 0)         */
#endif                                                                  /*  __PCICAPEXT_H               */
/*********************************************************************************************************
  END
*********************************************************************************************************/
