/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: pciScan.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2013 年 10 月 01 日
**
** 描        述: PCI 总线自动扫描匹配的设备驱动程序.
*********************************************************************************************************/

#ifndef __PCISCAN_H
#define __PCISCAN_H

/*********************************************************************************************************
  裁剪宏
*********************************************************************************************************/
#if (LW_CFG_DEVICE_EN > 0) && (LW_CFG_PCI_EN > 0)

/*********************************************************************************************************
  驱动程序描述结构
  vendor id 为 0xffff 表示所有设备均尝试安装此驱动.
  device id 为 0xffff 表示所有设备 id 均尝试安装此驱动.
*********************************************************************************************************/

typedef struct {
    PCHAR           PDDD_pcDrvName;                                     /*  驱动名称                    */
    UINT16          PDDD_usVendorId;                                    /*  对应 PCI 设备 vendor id     */
    UINT16          PDDD_usDeviceId;                                    /*  对应 PCI 设备 device id     */
    VOIDFUNCPTR     PDDD_pfuncDrv;                                      /*  驱动程序                    */
    PVOID           PDDD_pvArg;                                         /*  参数                        */
} PCI_DEV_DRV_DESC;

/*********************************************************************************************************
  API 
  API_PciScan() 必须在 rootfs 与 procfs 安装完成后才能调用, API_PciScan() 会自动创建 /proc/pci 文件.
*********************************************************************************************************/

LW_API INT      API_PciScan(PCI_DEV_DRV_DESC  *p_pdddTable, UINT  uiNum);

#define pciScan     API_PciScan

#endif                                                                  /*  (LW_CFG_DEVICE_EN > 0) &&   */
                                                                        /*  (LW_CFG_PCI_EN > 0)         */
#endif                                                                  /*  __PCISCAN_H                 */
/*********************************************************************************************************
  END
*********************************************************************************************************/
