/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: nvmeDev.h
**
** 创   建   人: Qin.Fei (秦飞)
**
** 文件创建日期: 2017 年 7 月 17 日
**
** 描        述: NVMe 设备管理.
*********************************************************************************************************/

#ifndef __NVME_DEV_H
#define __NVME_DEV_H

/*********************************************************************************************************
  裁剪宏
*********************************************************************************************************/
#if (LW_CFG_DEVICE_EN > 0) && (LW_CFG_NVME_EN > 0)

LW_API INT                  API_NvmeDevDelete(NVME_DEV_HANDLE  hDev);
LW_API INT                  API_NvmeDevAdd(NVME_DEV_HANDLE  hDev);
LW_API UINT32               API_NvmeDevCountGet(VOID);
LW_API INT                  API_NvmeDevInit(VOID);
LW_API NVME_DEV_HANDLE      API_NvmeDevHandleGet(UINT  uiCtrl, UINT  NamespaceId);

#endif                                                                  /*  (LW_CFG_DEVICE_EN > 0) &&   */
                                                                        /*  (LW_CFG_NVME_EN > 0)        */
#endif                                                                  /*  __NVME_DEV_H                */
/*********************************************************************************************************
  END
*********************************************************************************************************/
