/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: config.h
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2017 年 02 月 15 日
**
** 描        述: MIPS 非对齐处理配置头文件.
*********************************************************************************************************/

#ifndef __ARCH_MIPSUNALIGNEDCONFIG_H
#define __ARCH_MIPSUNALIGNEDCONFIG_H

#define CONFIG_32BIT            32                                      /*  使用 32 位                  */
#undef  CONFIG_64BIT                                                    /*  不使用 64 位                */

#define MIPS_CONFIG_EVA         0                                       /*  暂不支持增强虚拟地址(EVA)   */
#undef  CONFIG_EVA                                                      /*  暂不支持增强虚拟地址(EVA)   */

#undef  CONFIG_CPU_MIPSR6                                               /*  暂不支持 MIPSR6             */

#endif                                                                  /*  __ARCH_MIPSUNALIGNEDCONFIG_H*/
/*********************************************************************************************************
  END
*********************************************************************************************************/
