/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: excLib.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2007 年 03 月 30 日
**
** 描        述: 系统异常处理内部函数库头文件

** BUG
2007.04.08  加入了对裁剪的宏支持
*********************************************************************************************************/

#ifndef  __EXCLIB_H
#define  __EXCLIB_H

/*********************************************************************************************************
  裁剪控制
*********************************************************************************************************/

INT    _excInit(VOID);
INT    _excJobAdd(VOIDFUNCPTR  pfunc, 
                  PVOID        pvArg0, 
                  PVOID        pvArg1, 
                  PVOID        pvArg2, 
                  PVOID        pvArg3, 
                  PVOID        pvArg4, 
                  PVOID        pvArg5);
VOID   _excJobDel(UINT         uiMatchArgNum,
                  VOIDFUNCPTR  pfunc, 
                  PVOID        pvArg0, 
                  PVOID        pvArg1, 
                  PVOID        pvArg2, 
                  PVOID        pvArg3, 
                  PVOID        pvArg4, 
                  PVOID        pvArg5);
size_t  _ExcGetLost(VOID);

#endif                                                                  /*  __EXCLIB_H                  */
/*********************************************************************************************************
  END
*********************************************************************************************************/
