/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: listType.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2006 年 12 月 13 日
**
** 描        述: 这是系统使用的所有联表类型定义。

** BUG
2007.11.21  加入哈希链表.
2007.12.22  修改代码格式.
*********************************************************************************************************/

#ifndef  __LISTTYPE_H
#define  __LISTTYPE_H

/*********************************************************************************************************
  双向环形队列表
*********************************************************************************************************/

typedef struct __list_ring {
    struct __list_ring      *RING_plistNext;                            /*  环形表前向指针              */
    struct __list_ring      *RING_plistPrev;                            /*  环形表后向指针              */
} LW_LIST_RING;
typedef LW_LIST_RING        *PLW_LIST_RING;
typedef PLW_LIST_RING        LW_LIST_RING_HEADER;                       /*  环表表头                    */

/*********************************************************************************************************
  双向线形管理表
*********************************************************************************************************/

typedef struct __list_line {
	struct __list_line      *LINE_plistNext;                            /*  线形表前向指针              */
    struct __list_line      *LINE_plistPrev;                            /*  线形表后向指针              */
} LW_LIST_LINE;
typedef LW_LIST_LINE        *PLW_LIST_LINE;
typedef PLW_LIST_LINE        LW_LIST_LINE_HEADER;                       /*  线形表表头                  */

/*********************************************************************************************************
  单向资源分配表
*********************************************************************************************************/

typedef struct __list_mono {
	struct __list_mono      *MONO_plistNext;                            /*  资源表前向指针              */
} LW_LIST_MONO;
typedef LW_LIST_MONO        *PLW_LIST_MONO;
typedef PLW_LIST_MONO        LW_LIST_MONO_HEADER;                       /*  资源表表头                  */

/*********************************************************************************************************
  哈希链表
*********************************************************************************************************/

typedef struct __hlist_node {
    struct __hlist_node     *HNDE_phndeNext;                            /*  前向指针                    */
    struct __hlist_node    **HNDE_pphndePrev;                           /*  后向双指针                  */
} LW_HLIST_NODE;
typedef LW_HLIST_NODE       *PLW_HLIST_NODE;                            /*  节点指针类型                */

typedef struct __hlist_head {
    struct __hlist_node     *HLST_phndeFirst;                           /*  第一个节点                  */
} LW_HLIST_HEAD;
typedef LW_HLIST_HEAD       *PLW_HLIST_HEAD;                            /*  头指针类型                  */

#endif                                                                  /*  __LISTTYPE_H                */
/*********************************************************************************************************
  END
*********************************************************************************************************/
