/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: mipsL2R4k.h
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2017 年 07 月 18 日
**
** 描        述: MIPS R4K 体系构架 L2-CACHE 驱动.
*********************************************************************************************************/

#ifndef __ARCH_MIPSL2R4K_H
#define __ARCH_MIPSL2R4K_H

INT  mipsL2R4kProbe(VOID);
INT  mipsL2R4kInitHw(VOID);
INT  mipsL2R4kClear(PVOID  pvAdrs, size_t  stBytes);
INT  mipsL2R4kFlush(PVOID  pvAdrs, size_t  stBytes);
INT  mipsL2R4kInvalidate(PVOID  pvAdrs, size_t  stBytes);

#endif                                                                  /*  __ARCH_MIPSL2R4K_H          */
/*********************************************************************************************************
  END
*********************************************************************************************************/
