/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: armVfpNone.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2013 年 12 月 09 日
**
** 描        述: ARM 体系架构无 VFP 支持.
*********************************************************************************************************/
#define  __SYLIXOS_STDIO
#define  __SYLIXOS_KERNEL
#include "SylixOS.h"
/*********************************************************************************************************
  裁剪支持
*********************************************************************************************************/
#if LW_CFG_CPU_FPU_EN > 0
#include "../armFpu.h"
/*********************************************************************************************************
  全局变量
*********************************************************************************************************/
static ARM_FPU_OP   _G_fpuopVfpNone;
/*********************************************************************************************************
** 函数名称: armVfpNoneSid
** 功能描述: 获得 VFP SID
** 输　入  : NONE
** 输　出  : SID
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
#if !defined(__SYLIXOS_ARM_ARCH_M__)

static ULONG armVfpNoneSid (VOID)
{
    return  (0ul);
}

#endif                                                                  /*  !__SYLIXOS_ARM_ARCH_M__     */
/*********************************************************************************************************
** 函数名称: armVfpNoneEnable
** 功能描述: 使能 VFP
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  armVfpNoneEnable (VOID)
{
}
/*********************************************************************************************************
** 函数名称: armVfpNoneDisable
** 功能描述: 禁能 VFP
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  armVfpNoneDisable (VOID)
{
}
/*********************************************************************************************************
** 函数名称: armVfpNoneIsEnable
** 功能描述: 是否使能了 VFP
** 输　入  : NONE
** 输　出  : 是否使能
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static BOOL  armVfpNoneIsEnable (VOID)
{
    return  (LW_TRUE);
}
/*********************************************************************************************************
** 函数名称: armVfpNoneSave
** 功能描述: 保存 VFP 上下文
** 输　入  : pvFpuCtx  VFP 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  armVfpNoneSave (PVOID pvFpuCtx)
{
}
/*********************************************************************************************************
** 函数名称: armVfpNoneRestore
** 功能描述: 恢复 VFP 上下文
** 输　入  : pvFpuCtx  VFP 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  armVfpNoneRestore (PVOID pvFpuCtx)
{
}
/*********************************************************************************************************
** 函数名称: armVfpNoneCtxShow
** 功能描述: 显示 VFP 上下文
** 输　入  : iFd       输出文件描述符
**           pvFpuCtx  VFP 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  armVfpNoneCtxShow (INT iFd, PVOID pvFpuCtx)
{
#if (LW_CFG_DEVICE_EN > 0) && (LW_CFG_FIO_LIB_EN > 0)
    fdprintf(iFd, "no vfp\n");
#endif
}
/*********************************************************************************************************
** 函数名称: armVfpNonePrimaryInit
** 功能描述: 获取 VFP 控制器操作函数集
** 输　入  : pcMachineName 机器名
** 输　出  : 操作函数集
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
PARM_FPU_OP  armVfpNonePrimaryInit (CPCHAR  pcMachineName, CPCHAR  pcFpuName)
{
#if !defined(__SYLIXOS_ARM_ARCH_M__)
    _G_fpuopVfpNone.AFPU_pfuncHwSid    = armVfpNoneSid;
#endif                                                                  /*  !__SYLIXOS_ARM_ARCH_M__     */
    _G_fpuopVfpNone.AFPU_pfuncEnable   = armVfpNoneEnable;
    _G_fpuopVfpNone.AFPU_pfuncDisable  = armVfpNoneDisable;
    _G_fpuopVfpNone.AFPU_pfuncIsEnable = armVfpNoneIsEnable;
    _G_fpuopVfpNone.AFPU_pfuncSave     = armVfpNoneSave;
    _G_fpuopVfpNone.AFPU_pfuncRestore  = armVfpNoneRestore;
    _G_fpuopVfpNone.AFPU_pfuncCtxShow  = armVfpNoneCtxShow;

    return  (&_G_fpuopVfpNone);
}
/*********************************************************************************************************
** 函数名称: armVfpNoneSecondaryInit
** 功能描述: 初始化 VFP 控制器
** 输　入  : pcMachineName 机器名
**           pcFpuName     浮点运算器名
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  armVfpNoneSecondaryInit (CPCHAR  pcMachineName, CPCHAR  pcFpuName)
{
    (VOID)pcMachineName;
    (VOID)pcFpuName;
}

#endif                                                                  /*  LW_CFG_CPU_FPU_EN > 0       */
/*********************************************************************************************************
  END
*********************************************************************************************************/
