/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: x86FpuNone.h
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2016 年 07 月 04 日
**
** 描        述: x86 体系架构无 FPU 支持.
*********************************************************************************************************/

#ifndef __ARCH_X86FPUNONE_H
#define __ARCH_X86FPUNONE_H

PX86_FPU_OP  x86FpuNonePrimaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);
VOID         x86FpuNoneSecondaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);

#endif                                                                  /*  __ARCH_X86FPUNONE_H         */
/*********************************************************************************************************
  END
*********************************************************************************************************/
