/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: x86FpuNone.c
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2016 年 07 月 04 日
**
** 描        述: x86 体系架构无 FPU 支持.
*********************************************************************************************************/
#define  __SYLIXOS_STDIO
#define  __SYLIXOS_KERNEL
#include "SylixOS.h"
/*********************************************************************************************************
  裁剪支持
*********************************************************************************************************/
#if LW_CFG_CPU_FPU_EN > 0
#include "../x86Fpu.h"
/*********************************************************************************************************
  全局变量
*********************************************************************************************************/
static X86_FPU_OP   _G_fpuopFpuNone;
/*********************************************************************************************************
** 函数名称: x86FpuNoneEnable
** 功能描述: 使能 FPU
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  x86FpuNoneEnable (VOID)
{
}
/*********************************************************************************************************
** 函数名称: x86FpuNoneDisable
** 功能描述: 禁能 FPU
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  x86FpuNoneDisable (VOID)
{
}
/*********************************************************************************************************
** 函数名称: x86FpuNoneIsEnable
** 功能描述: 是否使能了 FPU
** 输　入  : NONE
** 输　出  : 是否使能
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static BOOL  x86FpuNoneIsEnable (VOID)
{
    return  (LW_TRUE);
}
/*********************************************************************************************************
** 函数名称: x86FpuNoneSave
** 功能描述: 保存 FPU 上下文
** 输　入  : pvFpuCtx  FPU 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  x86FpuNoneSave (PVOID  pvFpuCtx)
{
}
/*********************************************************************************************************
** 函数名称: x86FpuNoneRestore
** 功能描述: 恢复 FPU 上下文
** 输　入  : pvFpuCtx  FPU 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  x86FpuNoneRestore (PVOID  pvFpuCtx)
{
}
/*********************************************************************************************************
** 函数名称: x86FpuNoneCtxShow
** 功能描述: 显示 FPU 上下文
** 输　入  : iFd       输出文件描述符
**           pvFpuCtx  FPU 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  x86FpuNoneCtxShow (INT  iFd, PVOID  pvFpuCtx)
{
#if (LW_CFG_DEVICE_EN > 0) && (LW_CFG_FIO_LIB_EN > 0)
    fdprintf(iFd, "no FPU\n");
#endif
}
/*********************************************************************************************************
** 函数名称: x86FpuNoneEnableTask
** 功能描述: 系统发生 undef 异常时, 使能任务的 FPU
** 输　入  : ptcbCur    当前任务控制块
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
static VOID  x86FpuNoneEnableTask (PLW_CLASS_TCB  ptcbCur)
{
}
/*********************************************************************************************************
** 函数名称: x86FpuNonePrimaryInit
** 功能描述: 获取 FPU 控制器操作函数集
** 输　入  : pcMachineName 机器名
** 输　出  : 操作函数集
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
PX86_FPU_OP  x86FpuNonePrimaryInit (CPCHAR  pcMachineName, CPCHAR  pcFpuName)
{
    _G_fpuopFpuNone.PFPU_pfuncEnable     = x86FpuNoneEnable;
    _G_fpuopFpuNone.PFPU_pfuncDisable    = x86FpuNoneDisable;
    _G_fpuopFpuNone.PFPU_pfuncIsEnable   = x86FpuNoneIsEnable;
    _G_fpuopFpuNone.PFPU_pfuncSave       = x86FpuNoneSave;
    _G_fpuopFpuNone.PFPU_pfuncRestore    = x86FpuNoneRestore;
    _G_fpuopFpuNone.PFPU_pfuncCtxShow    = x86FpuNoneCtxShow;
    _G_fpuopFpuNone.PFPU_pfuncEnableTask = x86FpuNoneEnableTask;

    return  (&_G_fpuopFpuNone);
}
/*********************************************************************************************************
** 函数名称: x86FpuNoneSecondaryInit
** 功能描述: 初始化 FPU 控制器
** 输　入  : pcMachineName 机器名
**           pcFpuName     浮点运算器名
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  x86FpuNoneSecondaryInit (CPCHAR  pcMachineName, CPCHAR  pcFpuName)
{
    (VOID)pcMachineName;
    (VOID)pcFpuName;
}

#endif                                                                  /*  LW_CFG_CPU_FPU_EN > 0       */
/*********************************************************************************************************
  END
*********************************************************************************************************/
