/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: TimeShow.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2008 年 03 月 04 日
**
** 描        述: 打印操作系统时间信息, (打印到标准输出终端上)

** BUG:
2010.01.04  更新操作系统时间打印函数, 使用 clib 生成时间字串.
2010.07.10  使用 ctime_r() 可重入函数.
*********************************************************************************************************/
#define  __SYLIXOS_STDIO
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
#include "../SylixOS/system/include/s_system.h"
/*********************************************************************************************************
  加入裁剪支持
*********************************************************************************************************/
#if LW_CFG_FIO_LIB_EN > 0
/*********************************************************************************************************
** 函数名称: API_TimeShow
** 功能描述: 打印操作系统时间信息
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
                                           API 函数
                                           
                                       (不得在中断中调用)
*********************************************************************************************************/
LW_API  
VOID   API_TimeShow (VOID)
{
    printf("time show >>\n\n");
    printf("Kernel Ticks: %-63llu\n", API_TimeGet64());
    
#if LW_CFG_RTC_EN > 0
    {
        CHAR    cTimeBuffer[32];
        time_t  time = lib_time(LW_NULL);
        
        printf("%s", lib_ctime_r(&time, cTimeBuffer));
    }
#else
    printf("\n");
#endif                                                                  /*  LW_CFG_RTC_EN > 0           */
}

#endif                                                                  /*  LW_CFG_FIO_LIB_EN > 0       */
/*********************************************************************************************************
  END
*********************************************************************************************************/
