/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: romFs.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2012 年 06 月 27 日
**
** 描        述: rom 文件系统 sylixos 接口. (一些高可靠性低成本的产品可以使用 rom fs 启动)
*********************************************************************************************************/

#ifndef __ROMFS_H
#define __ROMFS_H

/*********************************************************************************************************
  裁剪宏
*********************************************************************************************************/
#if LW_CFG_MAX_VOLUMES > 0 && LW_CFG_ROMFS_EN > 0

/*********************************************************************************************************
  API
*********************************************************************************************************/
LW_API INT      API_RomFsDrvInstall(VOID);
LW_API INT      API_RomFsDevCreate(PCHAR   pcName, PLW_BLK_DEV  pblkd);
LW_API INT      API_RomFsDevDelete(PCHAR   pcName);

#define romFsDrv                API_RomFsDrvInstall
#define romFsDevCreate          API_RomFsDevCreate
#define romFsDevDelete          API_RomFsDevDelete

#endif                                                                  /*  LW_CFG_MAX_VOLUMES > 0      */
                                                                        /*  LW_CFG_ROMFS_EN > 0         */
#endif                                                                  /*  __ROMFS_H                   */
/*********************************************************************************************************
  END
*********************************************************************************************************/
