/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: lib_ctime.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2008 年 08 月 30 日
**
** 描        述: 系统库.

** BUG:
2010.01.04  lib_ctime() 使用本地时间.
2010.07.10  加入 lib_ctime_r().
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
#include "../SylixOS/system/include/s_system.h"
#include "lib_local.h"
/*********************************************************************************************************
  函数声明
*********************************************************************************************************/
PCHAR        lib_asctime_r(const struct tm *tmp, PCHAR  pcBuffer);
/*********************************************************************************************************
** 函数名称: lib_ctime_r
** 功能描述: 
** 输　入  : 
** 输　出  : 
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
#if LW_CFG_RTC_EN > 0

PCHAR  lib_ctime_r (const time_t *time, PCHAR  pcBuffer)
{
    struct tm  tmBuffer;
    
    if (!lib_localtime_r(time, &tmBuffer)) {
        return  (LW_NULL);
    }
    
    lib_asctime_r(&tmBuffer, pcBuffer);
    
    return  (pcBuffer);
}
/*********************************************************************************************************
** 函数名称: lib_ctime
** 功能描述: 
** 输　入  : 
** 输　出  : 
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
PCHAR  lib_ctime (const time_t *time)
{
    static CHAR  cTimeBuffer[sizeof(ASCBUF)];
    
    return  (lib_ctime_r(time, cTimeBuffer));
}

#endif                                                                  /*  LW_CFG_RTC_EN               */
/*********************************************************************************************************
  END
*********************************************************************************************************/
