/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: i8237a.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2016 年 08 月 26 日
**
** 描        述: Intel 8237A DMA 驱动支持.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "SylixOS.h"
#include "../SylixOS/config/driver/drv_cfg.h"
/*********************************************************************************************************
  裁减控制
*********************************************************************************************************/
#if (LW_CFG_DMA_EN > 0) && (LW_CFG_DRV_DMA_I8237A > 0)
#include "i8237a.h"
/*********************************************************************************************************
  i8237 chan
*********************************************************************************************************/
typedef struct {
    LW_DMA_FUNCS    dmafuncs;
    I8237A_CTL      ctl;
} I8237A_DMA_FUNCS;
/*********************************************************************************************************
** 函数名称: i8237aReset
** 功能描述: i8237a 控制器复位
** 输　入  : uiChan        通道号
**           pdmafuncs     操作函数集合
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  i8237aReset (UINT  uiChan, PLW_DMA_FUNCS  pdmafuncs)
{
    I8237A_DMA_FUNCS  *pi8237a = (I8237A_DMA_FUNCS *)pdmafuncs;
    
    (VOID)pi8237a;
}
/*********************************************************************************************************
** 函数名称: i8237aStatus
** 功能描述: 获得 i8237a 控制器状态
** 输　入  : uiChan        通道号
**           pdmafuncs     操作函数集合
** 输　出  : 状态
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static INT  i8237aStatus (UINT  uiChan, PLW_DMA_FUNCS  pdmafuncs)
{
    I8237A_DMA_FUNCS  *pi8237a = (I8237A_DMA_FUNCS *)pdmafuncs;
    
    (VOID)pi8237a;
    
    return  (LW_DMA_STATUS_IDLE);
}
/*********************************************************************************************************
** 函数名称: i8237aTrans
** 功能描述: i8237a 控制器设置一次传输
** 输　入  : uiChan        通道号
**           pdmafuncs     操作函数集合
**           pdmatMsg      传输控制信息
** 输　出  : 是否传输成功
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static INT  i8237aTrans (UINT  uiChan, PLW_DMA_FUNCS  pdmafuncs, PLW_DMA_TRANSACTION  pdmatMsg)
{
    I8237A_DMA_FUNCS  *pi8237a = (I8237A_DMA_FUNCS *)pdmafuncs;
    
    (VOID)pi8237a;
    
    return  (ERROR_NONE);
}
/*********************************************************************************************************
** 函数名称: i8237aGetFuncs
** 功能描述: 初始化 i8237a 驱动程序
** 输　入  : pctl       8237a 控制块
** 输　出  : DMA 驱动集合
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
PLW_DMA_FUNCS  i8237aGetFuncs (I8237A_CTL *pctl)
{
    static I8237A_DMA_FUNCS    i8237a;
           PLW_DMA_FUNCS       pdmafuncs = &i8237a.dmafuncs;
    
    i8237a.ctl = *pctl;
    
    if (pdmafuncs->DMAF_pfuncReset == LW_NULL) {
        pdmafuncs->DMAF_pfuncReset  = i8237aReset;
        pdmafuncs->DMAF_pfuncTrans  = i8237aTrans;
        pdmafuncs->DMAF_pfuncStatus = i8237aStatus;
    }
    
    return  (&i8237a.dmafuncs);
}

#endif                                                                  /*  LW_CFG_DMA_EN > 0           */
                                                                        /*  LW_CFG_DRV_DMA_I8237A > 0   */
/*********************************************************************************************************
  END
*********************************************************************************************************/
