/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: vi_sylixos.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2009 年 02 月 10 日
**
** 描        述: 操作系统 shell 接口
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
#include "../SylixOS/system/include/s_system.h"
#include "../SylixOS/shell/include/ttiny_shell.h"
/*********************************************************************************************************
  函数声明
*********************************************************************************************************/
#if LW_CFG_SHELL_EN > 0
int vi_main(int argc, char **argv);
#endif                                                                  /*  LW_CFG_SHELL_EN > 0         */
/*********************************************************************************************************
** 函数名称: viShellInit
** 功能描述: 初始化 vi shell 接口(当前 VI 有内存泄露, 不能两个用户同时打开... vi 仅能用于调试使用)
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  viShellInit (VOID)
{
#if LW_CFG_SHELL_EN > 0
    API_TShellKeywordAddEx("vi",  vi_main, LW_OPTION_KEYWORD_SYNCBG);
    API_TShellFormatAdd("vi",     " [-H]");
    API_TShellHelpAdd("vi", "(-H show help) busybox vi editor can Lead <Memory leak>! be carefull!\n");
#endif                                                                  /*  LW_CFG_SHELL_EN > 0         */
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
