/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: ramDisk.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2008 年 09 月 26 日
**
** 描        述: RAM DISK 驱动程序
*********************************************************************************************************/

#ifndef __RAMDISK_H
#define __RAMDISK_H

/*********************************************************************************************************
  裁剪宏
*********************************************************************************************************/
#if LW_CFG_MAX_VOLUMES > 0

LW_API ULONG    API_RamDiskCreate(PVOID  pvDiskAddr, UINT64  ullDiskSize, PLW_BLK_DEV  *ppblkdRam);
LW_API INT      API_RamDiskDelete(PLW_BLK_DEV  pblkdRam);

#define ramDiskCreate       API_RamDiskCreate
#define ramDiskDelete       API_RamDiskDelete

#endif                                                                  /*  LW_CFG_MAX_VOLUMES          */
#endif                                                                  /*  __RAMDISK_H                 */
/*********************************************************************************************************
  END
*********************************************************************************************************/
