/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: mipsVfpNone.h
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2015 年 12 月 01 日
**
** 描        述: MIPS 体系架构无 VFP 支持.
*********************************************************************************************************/

#ifndef __MIPSVFPNONE_H
#define __MIPSVFPNONE_H

PMIPS_FPU_OP  mipsVfpNonePrimaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);
VOID          mipsVfpNoneSecondaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);

#endif                                                                  /*  __MIPSVFPNONE_H             */
/*********************************************************************************************************
  END
*********************************************************************************************************/
