/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: mipsVfpNone.c
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2015 年 12 月 01 日
**
** 描        述: MIPS 体系架构无 VFP 支持.
*********************************************************************************************************/
#define  __SYLIXOS_STDIO
#define  __SYLIXOS_KERNEL
#include "SylixOS.h"
/*********************************************************************************************************
  裁剪支持
*********************************************************************************************************/
#if LW_CFG_CPU_FPU_EN > 0
#include "../mipsFpu.h"
/*********************************************************************************************************
  全局变量
*********************************************************************************************************/
static MIPS_FPU_OP   _G_fpuopVfpNone;
/*********************************************************************************************************
** 函数名称: mipsVfpNoneEnable
** 功能描述: 使能 VFP
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  mipsVfpNoneEnable (VOID)
{
}
/*********************************************************************************************************
** 函数名称: mipsVfpNoneDisable
** 功能描述: 禁能 VFP
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  mipsVfpNoneDisable (VOID)
{
}
/*********************************************************************************************************
** 函数名称: mipsVfpNoneIsEnable
** 功能描述: 是否使能了 VFP
** 输　入  : NONE
** 输　出  : 是否使能
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static BOOL  mipsVfpNoneIsEnable (VOID)
{
    return  (LW_TRUE);
}
/*********************************************************************************************************
** 函数名称: mipsVfpNoneSave
** 功能描述: 保存 VFP 上下文
** 输　入  : pvFpuCtx  VFP 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  mipsVfpNoneSave (PVOID pvFpuCtx)
{
}
/*********************************************************************************************************
** 函数名称: mipsVfpNoneRestore
** 功能描述: 恢复 VFP 上下文
** 输　入  : pvFpuCtx  VFP 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  mipsVfpNoneRestore (PVOID pvFpuCtx)
{
}
/*********************************************************************************************************
** 函数名称: mipsVfpNoneCtxShow
** 功能描述: 显示 VFP 上下文
** 输　入  : iFd       输出文件描述符
**           pvFpuCtx  VFP 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  mipsVfpNoneCtxShow (INT  iFd, PVOID  pvFpuCtx)
{
#if (LW_CFG_DEVICE_EN > 0) && (LW_CFG_FIO_LIB_EN > 0)
    fdprintf(iFd, "no vfp\n");
#endif
}
/*********************************************************************************************************
** 函数名称: mipsVfpNonePrimaryInit
** 功能描述: 获取 VFP 控制器操作函数集
** 输　入  : pcMachineName 机器名
** 输　出  : 操作函数集
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
PMIPS_FPU_OP  mipsVfpNonePrimaryInit (CPCHAR  pcMachineName, CPCHAR  pcFpuName)
{
    _G_fpuopVfpNone.MFPU_pfuncEnable   = mipsVfpNoneEnable;
    _G_fpuopVfpNone.MFPU_pfuncDisable  = mipsVfpNoneDisable;
    _G_fpuopVfpNone.MFPU_pfuncIsEnable = mipsVfpNoneIsEnable;
    _G_fpuopVfpNone.MFPU_pfuncSave     = mipsVfpNoneSave;
    _G_fpuopVfpNone.MFPU_pfuncRestore  = mipsVfpNoneRestore;
    _G_fpuopVfpNone.MFPU_pfuncCtxShow  = mipsVfpNoneCtxShow;

    return  (&_G_fpuopVfpNone);
}
/*********************************************************************************************************
** 函数名称: mipsVfpNoneSecondaryInit
** 功能描述: 初始化 VFP 控制器
** 输　入  : pcMachineName 机器名
**           pcFpuName     浮点运算器名
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  mipsVfpNoneSecondaryInit (CPCHAR  pcMachineName, CPCHAR  pcFpuName)
{
    (VOID)pcMachineName;
    (VOID)pcFpuName;
}

#endif                                                                  /*  LW_CFG_CPU_FPU_EN > 0       */
/*********************************************************************************************************
  END
*********************************************************************************************************/
