/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: sparcElf.h
**
** 创   建   人: Jiang.Taijin (蒋太金)
**
** 文件创建日期: 2017 年 10 月 13 日
**
** 描        述: 实现 SPARC 体系结构的 ELF 文件重定位.
*********************************************************************************************************/

#ifndef __ARCH_SPARC_ELF_H
#define __ARCH_SPARC_ELF_H

#ifdef LW_CFG_CPU_ARCH_SPARC                                            /*  SPARC 体系结构              */

#define ELF_CLASS       ELFCLASS32
#define ELF_ARCH        EM_SPARC

#endif                                                                  /*  LW_CFG_CPU_ARCH_SPARC       */
#endif                                                                  /*  __ARCH_SPARC_ELF_H          */
/*********************************************************************************************************
  END
*********************************************************************************************************/
