/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: ttiny_shell_api.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2008 年 07 月 27 日
**
** 描        述: 一个超小型的 shell 系统, 使用 tty/pty 做接口, API 接口
*********************************************************************************************************/

#ifndef __TTINY_SHELL_API_H
#define __TTINY_SHELL_API_H

/*********************************************************************************************************
  API 头文件
*********************************************************************************************************/
#include "../SylixOS/shell/ttinyShell/ttinyShell.h"
#include "../SylixOS/shell/ttinyShell/ttinyShellColor.h"
#include "../SylixOS/shell/ttinyVar/ttinyVar.h"
#include "../SylixOS/shell/getopt/getopt_var.h"
#include "../SylixOS/shell/getopt/getopt.h"
#include "../SylixOS/shell/getopt/getopt_long.h"

#endif                                                                  /*  __TTINY_SHELL_H             */
/*********************************************************************************************************
  END
*********************************************************************************************************/
