/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: ttniy_shell_error.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2008 年 07 月 27 日
**
** 描        述: 这是 ttniy_shell 错误代码定义.
*********************************************************************************************************/

#ifndef __TTINY_SHELL_ERROR_H
#define __TTINY_SHELL_ERROR_H

/*********************************************************************************************************
  ttniy_shell 错误代码定义 90000 - 90500
*********************************************************************************************************/
#define ERROR_TSHELL_EPARAM             90000                           /*  参数错误                    */
#define ERROR_TSHELL_OVERLAP            90001                           /*  关键字或帮助重复            */
#define ERROR_TSHELL_EKEYWORD           90002                           /*  关键词错误                  */
#define ERROR_TSHELL_EVAR               90003                           /*  变量名错误                  */
#define ERROR_TSHELL_CANNT_OVERWRITE    90004                           /*  变量不能被改写              */
#define ERROR_TSHELL_ENOUSER            90005                           /*  用户名错误                  */
#define ERROR_TSHELL_EUSER              90006                           /*  用户错误                    */
#define ERROR_TSHELL_ELEVEL             90007                           /*  权限不够                    */
#define ERROR_TSHELL_CMDNOTFUND         90008                           /*  无法找到命令                */

#endif                                                                  /*  __TTINY_SHELL_ERROR_H       */
/*********************************************************************************************************
  END
*********************************************************************************************************/
