/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: lib_strstr.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2007 年 02 月 13 日
**
** 描        述: 库
*********************************************************************************************************/
#include "../SylixOS/kernel/include/k_kernel.h"
/*********************************************************************************************************
** 函数名称: lib_strstr
** 功能描述: 
** 输　入  : 
** 输　出  : 
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
PCHAR  lib_strstr (CPCHAR  cpcS1, CPCHAR  cpcS2)
{
    REGISTER size_t     stLen;
    REGISTER PCHAR      pcS1 = (PCHAR)cpcS1;
    REGISTER PCHAR      pcS2 = (PCHAR)cpcS2;

    if (!pcS1 || !pcS2) {
        return  (LW_NULL);
    }
    
    stLen = lib_strlen(pcS2);
    if (stLen == 0) {
        return  (pcS1);
    
    } else {
        for (pcS1 = lib_strchr(pcS1, *pcS2); 
             pcS1; 
             pcS1 = lib_strchr(pcS1 + 1, *pcS2)) {
            
            if (lib_strncmp(pcS1, pcS2, stLen) == 0) {
                return  (pcS1);
            }
        }
        
        return  (LW_NULL);
    }
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
