/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: lib_strcmp.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2006 年 12 月 13 日
**
** 描        述: 库

** BUG:
2013.06.09  strcmp 需要使用 unsigned char 比较大小.
*********************************************************************************************************/
#include "../SylixOS/kernel/include/k_kernel.h"
/*********************************************************************************************************
** 函数名称: lib_strcmp
** 功能描述: 
** 输　入  : 
** 输　出  : 
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
INT    lib_strcmp (CPCHAR  pcStr1, CPCHAR  pcStr2)
{
    REGISTER PUCHAR      pucStr1Reg = (PUCHAR)pcStr1;
    REGISTER PUCHAR      pucStr2Reg = (PUCHAR)pcStr2;

    while (*pucStr1Reg == *pucStr2Reg) {
        if (*pucStr1Reg == PX_EOS) {
            return  (0);
        }
        pucStr1Reg++;
        pucStr2Reg++;
    }
    
    if (*pucStr1Reg > *pucStr2Reg) {
        return  (1);
    }
    
    return  (-1);
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
