/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: lib_strcasecmp.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2006 年 12 月 25 日
**
** 描        述: 库
*********************************************************************************************************/
#include "../SylixOS/kernel/include/k_kernel.h"
/*********************************************************************************************************
** 函数名称: lib_strcasecmp
** 功能描述: 
** 输　入  : 
** 输　出  : 
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
INT  lib_strcasecmp (CPCHAR cpcStr1, CPCHAR  cpcStr2)
{
    REGISTER PCHAR      pcStr1 = (PCHAR)cpcStr1;
    REGISTER PCHAR      pcStr2 = (PCHAR)cpcStr2;

    while (lib_toupper((UCHAR)*pcStr1) == lib_toupper((UCHAR)*pcStr2)) {
        if (*pcStr1 == PX_EOS) {
            return  (0);
        }
        pcStr1++;
        pcStr2++;
    }
    
    return  (lib_toupper((UCHAR)*pcStr1) - lib_toupper((UCHAR)*pcStr2));
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
