/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: gdbmodule.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2016 年 06 月 15 日
**
** 描        述: 硬件 GDB 调试器生成对应模块与应用程序符号表命令.
*********************************************************************************************************/

#ifndef __GDBMODULE_H
#define __GDBMODULE_H

#include "SylixOS.h"

LW_API VOID  API_GdbModuleInit(VOID);                                   /*  必须在 SHELL 初始化之后调用 */

#define gdbModuleInit   API_GdbModuleInit

#endif                                                                  /*  __GDBMODULE_H               */
/*********************************************************************************************************
  END
*********************************************************************************************************/
