/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: openocd.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2015 年 11 月 19 日
**
** 描        述: SylixOS OpenOCD 调试器支持.
*********************************************************************************************************/

#ifndef __OPENOCD_H
#define __OPENOCD_H

/*********************************************************************************************************
  说明:
  API_OpenOCDStep1(), API_OpenOCDStep2(), API_OpenOCDStep3() 为三个 OpenOCD 接口初始化函数, 必须按顺序调用
  这三个函数调用需要在操作系统初始化 CACHE 之前, 推荐放在 bspInit 入口位置.
  在系统执行之前, 需要在 API_OpenOCDStep2() 建立断点, 然后单步执行, 直到 API_OpenOCDStep3() 执行完毕.
*********************************************************************************************************/

LW_API VOID     API_OpenOCDStep1(VOID);
LW_API VOID     API_OpenOCDStep2(VOID);
LW_API VOID     API_OpenOCDStep3(VOID);

#endif                                                                  /*  __OPENOCD_H                 */
/*********************************************************************************************************
  END
*********************************************************************************************************/
