/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: ppcMmu.h
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2016 年 01 月 14 日
**
** 描        述: PowerPC 体系构架 MMU 驱动.
*********************************************************************************************************/

#ifndef __ARCH_PPCMMU_H
#define __ARCH_PPCMMU_H

VOID   ppcMmuInit(LW_MMU_OP *pmmuop, CPCHAR  pcMachineName);

ULONG  ppcMmuPteMissHandle(addr_t  ulAddr);
INT    ppcMmuPtePreLoad(addr_t  ulAddr);

UINT32 ppcMmuGetSRR1(VOID);
UINT32 ppcMmuGetDSISR(VOID);

#endif                                                                  /*  __ARCH_PPCMMU_H             */
/*********************************************************************************************************
  END
*********************************************************************************************************/
