/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: assert.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2009 年 04 月 02 日
**
** 描        述: 兼容 C 库.
*********************************************************************************************************/

#ifndef __ASSERT_H
#define __ASSERT_H

#ifndef __SYLIXOS_H
#include "SylixOS.h"
#endif                                                                  /*  __SYLIXOS_H                 */

#ifdef __cplusplus
extern "C" {
#endif

#ifdef  __SYLIXOS_DEBUG
__LW_RETU_FUNC_DECLARE(void, assert, (int expression))
#else
#define assert(e)   ((void)0)
#endif                                                                  /*  __SYLIXOS_DEBUG             */

#ifdef __cplusplus
}
#endif

#endif                                                                  /*  __ASSERT_H                  */
/*********************************************************************************************************
  END
*********************************************************************************************************/
