/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: panic.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2011 年 08 月 16 日
**
** 描        述: panic.
*********************************************************************************************************/

#ifndef __PANIC_H
#define __PANIC_H

#ifndef __SYLIXOS_H
#include "SylixOS.h"
#endif                                                                  /*  __SYLIXOS_H                 */

#ifdef __cplusplus
extern "C" {
#endif                                                                  /*  __cplusplus                 */

#include "../SylixOS/lib/libc/error/lib_error.h"                        /*  此头文件默认没有加入        */

extern void  panic(const char  *pcFormat, ...);

#ifdef __cplusplus
}
#endif                                                                  /*  __cplusplus                 */

#endif                                                                  /*  __PANIC_H                   */
/*********************************************************************************************************
  END
*********************************************************************************************************/
