/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: sigcontextinfo.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2014 年 09 月 30 日
**
** 描        述: 信号上下文.
*********************************************************************************************************/

#ifndef __SIGCONTEXTINFO_H
#define __SIGCONTEXTINFO_H

#include "SylixOS.h"

typedef ARCH_REG_CTX    SIGCONTEXT;                                     /*  信号上下文                  */

#define GET_PC(ctx)     ARCH_REG_CTX_GET_PC(ctx)
#define GET_FRAME(ctx)  ARCH_REG_CTX_GET_FRAME(ctx)
#define GET_STACK(ctx)  ARCH_REG_CTX_GET_STACK(ctx)

#endif                                                                  /*  __STRINGS_H                 */
/*********************************************************************************************************
  END
*********************************************************************************************************/
