/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: stdio.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2009 年 04 月 02 日
**
** 描        述: 兼容 C 库.
*********************************************************************************************************/

#ifndef __STDIO_H
#define __STDIO_H

#ifdef  __SYLIXOS_KERNEL
#define __SYLIXOS_STDIO
#endif                                                                  /*  __SYLIXOS_KERNEL            */

#ifndef __SYLIXOS_H
#include "SylixOS.h"
#else

#ifdef __cplusplus
extern "C" {
#endif
#include "../SylixOS/lib/libc/stdio/lib_stdio.h"
#ifdef __cplusplus
}
#endif

#endif                                                                  /*  __SYLIXOS_H                 */

#endif                                                                  /*  __STDIO_H                   */
/*********************************************************************************************************
  END
*********************************************************************************************************/
