/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: userdb.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2015 年 09 月 17 日
**
** 描        述: 多用户管理数据库.
*********************************************************************************************************/

#ifndef __USERDB_H
#define __USERDB_H

#include "unistd.h"

#ifdef __cplusplus
extern "C" {
#endif

/*********************************************************************************************************
  注意: 以下函数为线程非安全, 必须采用单线程操作.
*********************************************************************************************************/
/*********************************************************************************************************
  用户操作 (添加 \ 更改 \ 获取 \ 删除)
*********************************************************************************************************/

extern int  user_db_uadd(const char  *user, const char  *passwd, int enable,
                         uid_t  uid, gid_t  gid, 
                         const char *comment, const char  *home);
extern int  user_db_umod(const char  *user, int enable,
                         const char *comment, const char  *home);
extern int  user_db_uget(const char  *user, int *enable,
                         uid_t *uid, gid_t *gid, 
                         char *comment, size_t sz_com, char  *home, size_t sz_home);
extern int  user_db_udel(const char  *user);

/*********************************************************************************************************
  组操作 (添加 \ 更改 \ 获取 \ 删除)
*********************************************************************************************************/

extern int  user_db_gadd(const char  *group, gid_t  gid);
extern int  user_db_gget(const char  *group, gid_t *gid);
extern int  user_db_gdel(const char  *group);

/*********************************************************************************************************
  密码操作 (passwd_new == NULL 表示清除密码)
*********************************************************************************************************/

extern int  user_db_pmod(const char  *user, const char  *passwd_old, const char  *passwd_new);

#ifdef __cplusplus
}
#endif

#endif                                                                  /*  __GRP_H                     */
/*********************************************************************************************************
  END
*********************************************************************************************************/
