/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: lwip_ping6.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2011 年 06 月 07 日
**
** 描        述: lwip ipv6 ping 工具. 
*********************************************************************************************************/

#ifndef __LWIP_PING6_H
#define __LWIP_PING6_H

/*********************************************************************************************************
  裁剪控制
*********************************************************************************************************/
#if (LW_CFG_NET_EN > 0) && (LW_CFG_NET_PING_EN > 0)

LW_API VOID     API_INetPing6Init(VOID);

#define inetPing6Init        API_INetPing6Init

#ifdef __LWIP_INET6_H__                                                  /*  include inet.h              */
LW_API INT      API_INetPing6(struct in6_addr *pin6addr, 
                              INT              iTimes, 
                              INT              iDataSize, 
                              INT              iTimeout,
                              CPCHAR           pcNetif);
#define inetPing        API_INetPing6
#endif                                                                  /*  __LWIP_INET_H__             */

#endif                                                                  /*  (LW_CFG_NET_EN > 0)         */
                                                                        /*  (LW_CFG_NET_PING_EN > 0)    */
#endif                                                                  /*  __LWIP_PING6_H              */
/*********************************************************************************************************
  END
*********************************************************************************************************/
