/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: sysperf.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2016 年 07 月 28 日
**
** 描        述: 系统性能分析工具.
*********************************************************************************************************/

#ifndef __SYSPERF_H
#define __SYSPERF_H

#include "SylixOS.h"

/*********************************************************************************************************
  裁剪支持
*********************************************************************************************************/
#if (LW_CFG_SYSPERF_EN > 0) && (LW_CFG_MODULELOADER_EN > 0)

/*********************************************************************************************************
  参数配置
*********************************************************************************************************/

#define LW_SYSPERF_FUNC_NAME_MAX    64

/*********************************************************************************************************
  性能分析数据结构
*********************************************************************************************************/

typedef struct {
    LW_LIST_RING            PERF_ringManage;                            /*  内部管理链表                */
    ULONG                   PERF_ulCPUId;                               /*  CPU ID                      */
    ULONG                   PERF_ulCounter;                             /*  函数计数                    */
    LW_OBJECT_HANDLE        PERF_ulThread;                              /*  线程句柄                    */
    pid_t                   PERF_pid;                                   /*  进程 ID                     */
    addr_t                  PERF_ulSymAddr;                             /*  符号地址                    */
    addr_t                  PERF_ulSamAddr;                             /*  采样地址                    */
    CHAR                    PERF_cFunc[LW_SYSPERF_FUNC_NAME_MAX];       /*  执行函数名                  */
} LW_SYSPERF_INFO;
typedef LW_SYSPERF_INFO    *PLW_SYSPERF_INFO;

/*********************************************************************************************************
  API
*********************************************************************************************************/

LW_API INT      API_SysPerfStart(UINT  uiPipeLen, UINT  uiPerfNum, UINT  uiRefreshPeriod);
LW_API INT      API_SysPerfStop(VOID);
LW_API INT      API_SysPerfRefresh(VOID);
LW_API INT      API_SysPerfInfo(PLW_SYSPERF_INFO  psysperf, UINT  uiPerfNum);

#define sysperfStart    API_SysPerfStart
#define sysperfStop     API_SysPerfStop
#define sysperfInfo     API_SysPerfInfo

#endif                                                                  /*  LW_CFG_SYSPERF_EN > 0       */
                                                                        /*  LW_CFG_MODULELOADER_EN > 0  */
#endif                                                                  /*  __SYSPERF_H                 */
/*********************************************************************************************************
  END
*********************************************************************************************************/
