/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: ptyLib.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2008 年 06 月 13 日
**
** 描        述: 虚拟终端内部库.
*********************************************************************************************************/

#ifndef __PTYLIB_H
#define __PTYLIB_H

/*********************************************************************************************************
  PTY 设备端结构 (虚拟一个串口)
*********************************************************************************************************/

typedef struct {
    DEV_HDR                 PTYDDEV_devhdrDevice;                       /*  设备头                      */
    LW_OBJECT_HANDLE        PTYDDEV_hRdSyncSemB;                        /*  读同步                      */
    BOOL                    PTYDDEV_bIsClose;                           /*  是否关闭了                  */
    LW_SEL_WAKEUPLIST       PTYDDEV_selwulList;                         /*  select() 链表               */
    ULONG                   PTYDDEV_ulRTimeout;                         /*  读操作超时时间              */
    INT                     PTYDDEV_iAbortFlag;                         /*  abort 标志                  */
    time_t                  PTYDDEV_timeCreate;                         /*  创建时间                    */
} PTY_D_DEV;
typedef PTY_D_DEV          *P_PTY_D_DEV;

/*********************************************************************************************************
  PTY 应用端结构 (类似一个 tty 设备)
*********************************************************************************************************/

typedef struct {
    TY_DEV                  PTYHDEV_tydevTyDev;                         /*  ty 库结构                   */
} PTY_H_DEV;
typedef PTY_H_DEV          *P_PTY_H_DEV;

/*********************************************************************************************************
  PTY 设备结构
*********************************************************************************************************/

typedef struct {
    PTY_H_DEV               PTYDEV_ptyhdev;                             /*  本地串口                    */
    PTY_D_DEV               PTYDEV_ptyddev;                             /*  模拟硬件行为                */
} PTY_DEV;
typedef PTY_DEV            *P_PTY_DEV;

#endif                                                                  /*  __PTYLIB_H                  */
/*********************************************************************************************************
  END
*********************************************************************************************************/
