/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: InterContext.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2006 年 12 月 18 日
**
** 描        述: 检查系统是否在中断状态下, 获得系统中断嵌套层数.

** BUG:
2013.07.18  去掉 API_InterGetNestingEx, 此 API 不再适用于 SMP 系统
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
/*********************************************************************************************************
** 函数名称: API_InterGetNesting
** 功能描述: 获得系统中断嵌套层数
** 输　入  : NONE
** 输　出  : 当前系统嵌套层数
** 全局变量: 
** 调用模块: 
                                           API 函数
*********************************************************************************************************/
LW_API
ULONG  API_InterGetNesting (VOID)
{
    return  (LW_CPU_GET_CUR_NESTING());
}
/*********************************************************************************************************
** 函数名称: API_InterGetNestingById
** 功能描述: 获得指定 CPU 的中断嵌套层数
** 输　入  : ulCPUId           CPU ID
**           pulMaxNesting     最大嵌套层数
** 输　出  : 当前系统嵌套层数
** 全局变量: 
** 调用模块: 
                                           API 函数
*********************************************************************************************************/
LW_API
ULONG  API_InterGetNestingById (ULONG  ulCPUId, ULONG *pulMaxNesting)
{
    if (ulCPUId >= LW_NCPUS) {
        _ErrorHandle(EINVAL);
        return  (0);
    }
    
    if (pulMaxNesting) {
        *pulMaxNesting = LW_CPU_GET_NESTING_MAX(ulCPUId);
    }
    
    return  (LW_CPU_GET_NESTING(ulCPUId));
}
/*********************************************************************************************************
** 函数名称: API_InterContext
** 功能描述: 检查系统是否在中断状态下
** 输　入  : 
** 输　出  : 
** 全局变量: 
** 调用模块: 
                                           API 函数
*********************************************************************************************************/
LW_API
BOOL  API_InterContext (VOID)
{
    if (LW_CPU_GET_CUR_NESTING()) {
        return  (LW_TRUE);
    
    } else {
        return  (LW_FALSE);
    }
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
