/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: InterVectorMeasure.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2017 年 07 月 11 日
**
** 描        述: 中断测量相关接口.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
/*********************************************************************************************************
  裁剪控制
*********************************************************************************************************/
#if LW_CFG_INTER_MEASURE_HOOK_EN > 0
/*********************************************************************************************************
  中断测量回调
*********************************************************************************************************/
VOIDFUNCPTR     _K_pfuncInterVectorMeasureEnter = LW_NULL;
VOIDFUNCPTR     _K_pfuncInterVectorMeasureExit  = LW_NULL;
/*********************************************************************************************************
** 函数名称: API_InterVectorMeasureHook
** 功能描述: 安装/卸载中断向量测量回调
** 输　入  : pfuncEnter        中断进入回调
**           pfuncExit         中断退出回调
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
                                           API 函数
*********************************************************************************************************/
LW_API
VOID  API_InterVectorMeasureHook (VOIDFUNCPTR  pfuncEnter, VOIDFUNCPTR  pfuncExit)
{
    INTREG    iregInterLevel;
    
    iregInterLevel = __KERNEL_ENTER_IRQ();
    _K_pfuncInterVectorMeasureEnter = pfuncEnter;
    _K_pfuncInterVectorMeasureExit  = pfuncExit;
    __KERNEL_EXIT_IRQ(iregInterLevel);
}

#endif                                                                  /*  LW_CFG_INTER_MEASURE_HOOK_EN*/
/*********************************************************************************************************
  END
*********************************************************************************************************/
