/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: InterVectorBase.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2007 年 02 月 02 日
**
** 描        述: 设置系统中断向量表基地址.

** BUG:
2010.08.03  仅能在系统启动前初始化中断向量表.
            设置中断向量表时需要加入对 spinlock 的初始化.
2013.12.22  系统不再提供对中断向量表的定位功能.
*********************************************************************************************************/
#define  __SYLIXOS_STDIO
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
/*********************************************************************************************************
** 函数名称: API_InterVectorBaseGet
** 功能描述: 获得系统中断向量表基地址
** 输　入  : NONE
** 输　出  : 基地址指针
** 全局变量: 
** 调用模块: 
                                           API 函数
********************************************************************************************************/
LW_API
PVOID  API_InterVectorBaseGet (VOID)
{    
    return  ((PVOID)&_K_idescTable[0]);
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
