/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: KernelGetThreadNum.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2007 年 05 月 11 日
**
** 描        述: 用户可以调用这个 API 获得当前线程数量

** BUG
2008.05.18  使用 __KERNEL_ENTER() 代替 ThreadLock();
2008.05.31  改为关闭中断方式.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
/*********************************************************************************************************
** 函数名称: API_KernelGetThreadNum
** 功能描述: 获得当前线程数量
** 输　入  : NONE
** 输　出  : 当前线程数量
** 全局变量: 
** 调用模块: 
                                           API 函数
*********************************************************************************************************/
LW_API  
UINT16  API_KernelGetThreadNum (VOID)
{
    REGISTER UINT16     usThreadNum;
    
    __KERNEL_ENTER();                                                   /*  进入内核                    */
    usThreadNum = _K_usThreadCounter;
    __KERNEL_EXIT();                                                    /*  退出内核                    */

    return  (usThreadNum);
}
/*********************************************************************************************************
** 函数名称: API_KernelGetThreadNumByPriority
** 功能描述: 获得内核指定优先级的线程数量
** 输　入  : NONE
** 输　出  : 内核指定优先级的线程数量
** 全局变量: 
** 调用模块: 
** 注  意  : 从 1.0.0-rc44 版本开始, 不再支持此函数.

                                           API 函数
*********************************************************************************************************/
LW_API  
UINT16  API_KernelGetThreadNumByPriority (UINT8  ucPriority)
{
    _ErrorHandle(ENOSYS);
    return  (0);
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
