/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: TimeGet.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2007 年 01 月 26 日
**
** 描        述: 设置/获得系统时间

** BUG:
2007.07.25  检查 RMS 调度器，当有 RMS 在使用的时候，不能修改系统时间。
2008.04.12  由于越来越多的功能依赖于系统 tick 计数, 所以从 095 版本后不再允许修改系统时钟.
2009.06.12  errno 设置为 ERROR_KERNEL_RUNNING.
2009.12.31  加入 64 bit 时间获取.
2010.08.03  支持 SMP 多核.
2012.12.28  将 API_TimeGetFrequency 放在本文件中.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
/*********************************************************************************************************
** 函数名称: API_TimeGetFrequency
** 功能描述: 获得系统时间频率
** 输　入  : 
** 输　出  : 系统时间频率
** 全局变量: 
** 调用模块: 
                                           API 函数
*********************************************************************************************************/
LW_API  
ULONG  API_TimeGetFrequency (VOID)
{
    return  (LW_TICK_HZ);
}
/*********************************************************************************************************
** 函数名称: API_TimeGet
** 功能描述: 获得系统时间
** 输　入  : 
** 输　出  : 系统时间
** 全局变量: 
** 调用模块: 
                                           API 函数
*********************************************************************************************************/
LW_API  
ULONG  API_TimeGet (VOID)
{
    ULONG   ulTime;
    
    __KERNEL_TIME_GET(ulTime, ULONG);
    
    return  (ulTime);
}
/*********************************************************************************************************
** 函数名称: API_TimeGet64
** 功能描述: 获得系统时间
** 输　入  : 
** 输　出  : 系统时间
** 全局变量: 
** 调用模块: 
                                           API 函数
*********************************************************************************************************/
LW_API  
INT64  API_TimeGet64 (VOID) 
{
    INT64   i64Time;
    
    __KERNEL_TIME_GET(i64Time, INT64);
    
    return  (i64Time);
}
/*********************************************************************************************************
** 函数名称: API_TimeSet
** 功能描述: 设置系统时间
** 输　入  : ulKernenlTime                 系统时间
** 输　出  : 
** 全局变量: 
** 调用模块: 
                                           API 函数
*********************************************************************************************************/
LW_API  
VOID  API_TimeSet (ULONG  ulKernenlTime)
{
    _ErrorHandle(ERROR_KERNEL_RUNNING);
    return;
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
