/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: randDevLib.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2012 年 10 月 31 日
**
** 描        述: UNIX 兼容随机数设备.
*********************************************************************************************************/

#ifndef __RANDDEVLIB_H
#define __RANDDEVLIB_H

/*********************************************************************************************************
  加入裁剪支持
*********************************************************************************************************/
#if LW_CFG_DEVICE_EN > 0

/*********************************************************************************************************
  rand 设备
*********************************************************************************************************/

typedef struct {
    LW_DEV_HDR           RANDDEV_devhdr;                                /*  设备头                      */
    BOOL                 RANDDEV_bIsURand;                              /*  是否为 urandom              */
} LW_RAND_DEV;
typedef LW_RAND_DEV     *PLW_RAND_DEV;

/*********************************************************************************************************
  rand 文件
*********************************************************************************************************/

typedef struct {
    PLW_RAND_DEV         RANDFIL_pranddev;                              /*  设备                        */
    LW_SEL_WAKEUPLIST    RANDFIL_selwulList;                            /*  select() 等待链             */
} LW_RAND_FIL;
typedef LW_RAND_FIL     *PLW_RAND_FIL;

/*********************************************************************************************************
  rand 设备驱动
*********************************************************************************************************/
VOID    __randInit(VOID);
LONG    __randOpen(PLW_RAND_DEV  pranddev, PCHAR  pcName, INT  iFlags, INT  iMode);
INT     __randClose(PLW_RAND_FIL  prandfil);
ssize_t __randRead(PLW_RAND_FIL  prandfil, PCHAR  pcBuffer, size_t  stMaxBytes);
ssize_t __randWrite(PLW_RAND_FIL  prandfil, CPCHAR  pcBuffer, size_t  stNBytes);
INT     __randIoctl(PLW_RAND_FIL  prandfil, INT  iRequest, LONG  lArg);

#endif                                                                  /*  LW_CFG_DEVICE_EN            */
#endif                                                                  /*  __RANDDEVLIB_H              */
/*********************************************************************************************************
  END
*********************************************************************************************************/
