/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: armVfp9.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2013 年 12 月 09 日
**
** 描        述: ARM 体系架构 VFP9 (VFPv2 for ARM9) 支持.
*********************************************************************************************************/

#ifndef __ARMVFP9_H
#define __ARMVFP9_H

PARM_FPU_OP  armVfp9PrimaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);
VOID         armVfp9SecondaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);

#endif                                                                  /*  __ARMVFP9_H                 */
/*********************************************************************************************************
  END
*********************************************************************************************************/
