/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: hstimerfdDev.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2013 年 12 月 03 日
**
** 描        述: 高频率定时器设备.
*********************************************************************************************************/

#ifndef __HSTIMERFDDEV_H
#define __HSTIMERFDDEV_H

/*********************************************************************************************************
  裁减控制
*********************************************************************************************************/
#if (LW_CFG_PTIMER_EN > 0) && (LW_CFG_TIMERFD_EN > 0)

/*********************************************************************************************************
  设备路径
*********************************************************************************************************/

#define LW_HSTMRFD_DEV_PATH "/dev/hstimerfd"

/*********************************************************************************************************
  设备与文件结构
*********************************************************************************************************/

typedef struct {
    LW_DEV_HDR              HD_devhdrHdr;                               /*  设备头                      */
} LW_HSTMRFD_DEV;
typedef LW_HSTMRFD_DEV     *PLW_HSTMRFD_DEV;

typedef struct {
#define LW_HSTIMER_FILE_MAGIC   0x35bc7961
    UINT32                  HF_uiMagic;
    INT                     HF_iFlag;                                   /*  打开文件的选项              */
    PVOID                   HF_pvTimer;                                 /*  内核高速定时器结构          */
    LW_OBJECT_HANDLE        HF_ulTimer;
    LW_OBJECT_HANDLE        HF_ulReadLock;
    LW_SEL_WAKEUPLIST       HF_selwulist;
} LW_HSTMRFD_FILE;
typedef LW_HSTMRFD_FILE    *PLW_HSTMRFD_FILE;

/*********************************************************************************************************
  初始化操作
*********************************************************************************************************/

LW_API INT  API_HstimerfdDrvInstall(VOID);
LW_API INT  API_HstimerfdDevCreate(VOID);

#define hstimerfdDrv        API_HstimerfdDrvInstall
#define hstimerfdDevCreate  API_HstimerfdDevCreate

#endif                                                                  /*  LW_CFG_PTIMER_EN > 0        */
                                                                        /*  LW_CFG_TIMERFD_EN > 0       */
#endif                                                                  /*  __TIMERDEV_H                */
/*********************************************************************************************************
  END
*********************************************************************************************************/
